theatrus/ksdk/platform/CMSIS/Include/device/MKV10Z7/MKV10Z7_registers.h
/*! @brief Read current value of the DMA_HRS_HRS0 field. */
#define BR_DMA_HRS_HRS0(x)   (BME_UBFX32(HW_DMA_HRS_ADDR(x), BP_DMA_HRS_HRS0, BS_DMA_HRS_HRS0))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS1[1] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0 - A hardware service request for channel 1 is not present
 * - 1 - A hardware service request for channel 1 is present
 */
/*@{*/
#define BP_DMA_HRS_HRS1      (1U)          /*!< Bit position for DMA_HRS_HRS1. */
#define BM_DMA_HRS_HRS1      (0x00000002U) /*!< Bit mask for DMA_HRS_HRS1. */
#define BS_DMA_HRS_HRS1      (1U)          /*!< Bit field size in bits for DMA_HRS_HRS1. */

/*! @brief Read current value of the DMA_HRS_HRS1 field. */
#define BR_DMA_HRS_HRS1(x)   (BME_UBFX32(HW_DMA_HRS_ADDR(x), BP_DMA_HRS_HRS1, BS_DMA_HRS_HRS1))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS2[2] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0 - A hardware service request for channel 2 is not present
 * - 1 - A hardware service request for channel 2 is present
 */
/*@{*/
#define BP_DMA_HRS_HRS2      (2U)          /*!< Bit position for DMA_HRS_HRS2. */
#define BM_DMA_HRS_HRS2      (0x00000004U) /*!< Bit mask for DMA_HRS_HRS2. */
#define BS_DMA_HRS_HRS2      (1U)          /*!< Bit field size in bits for DMA_HRS_HRS2. */

/*! @brief Read current value of the DMA_HRS_HRS2 field. */
#define BR_DMA_HRS_HRS2(x)   (BME_UBFX32(HW_DMA_HRS_ADDR(x), BP_DMA_HRS_HRS2, BS_DMA_HRS_HRS2))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS3[3] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0 - A hardware service request for channel 3 is not present
 * - 1 - A hardware service request for channel 3 is present
 */
/*@{*/
#define BP_DMA_HRS_HRS3      (3U)          /*!< Bit position for DMA_HRS_HRS3. */
#define BM_DMA_HRS_HRS3      (0x00000008U) /*!< Bit mask for DMA_HRS_HRS3. */
#define BS_DMA_HRS_HRS3      (1U)          /*!< Bit field size in bits for DMA_HRS_HRS3. */

/*! @brief Read current value of the DMA_HRS_HRS3 field. */
#define BR_DMA_HRS_HRS3(x)   (BME_UBFX32(HW_DMA_HRS_ADDR(x), BP_DMA_HRS_HRS3, BS_DMA_HRS_HRS3))
/*@}*/

/*******************************************************************************
 * HW_DMA_EARS - Enable Asynchronous Request in Stop Register
 ******************************************************************************/

/*!
 * @brief HW_DMA_EARS - Enable Asynchronous Request in Stop Register (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_dma_ears
{
    uint32_t U;
    struct _hw_dma_ears_bitfields
    {
        uint32_t EDREQ_0 : 1;          /*!< [0] Enable asynchronous DMA request in
                                        * stop mode for channel 0. */
        uint32_t EDREQ_1 : 1;          /*!< [1] Enable asynchronous DMA request in
                                        * stop mode for channel 1. */
        uint32_t EDREQ_2 : 1;          /*!< [2] Enable asynchronous DMA request in
                                        * stop mode for channel 2. */
        uint32_t EDREQ_3 : 1;          /*!< [3] Enable asynchronous DMA request in
                                        * stop mode for channel 3. */
        uint32_t RESERVED0 : 28;       /*!< [31:4]  */
    } B;
} hw_dma_ears_t;

/*!
 * @name Constants and macros for entire DMA_EARS register
 */
/*@{*/
#define HW_DMA_EARS_ADDR(x)      ((uint32_t)(x) + 0x44U)

#define HW_DMA_EARS(x)           (*(__IO hw_dma_ears_t *) HW_DMA_EARS_ADDR(x))
#define HW_DMA_EARS_RD(x)        (HW_DMA_EARS(x).U)
#define HW_DMA_EARS_WR(x, v)     (HW_DMA_EARS(x).U = (v))
#define HW_DMA_EARS_SET(x, v)    (BME_OR32(HW_DMA_EARS_ADDR(x), (uint32_t)(v)))
#define HW_DMA_EARS_CLR(x, v)    (BME_AND32(HW_DMA_EARS_ADDR(x), (uint32_t)(~(v))))
#define HW_DMA_EARS_TOG(x, v)    (BME_XOR32(HW_DMA_EARS_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual DMA_EARS bitfields
 */

/*!
 * @name Register DMA_EARS, field EDREQ_0[0] (RW)
 *
 * Values:
 * - 0 - Disable asynchronous DMA request for channel 0.
 * - 1 - Enable asynchronous DMA request for channel 0.
 */
/*@{*/
#define BP_DMA_EARS_EDREQ_0  (0U)          /*!< Bit position for DMA_EARS_EDREQ_0. */
#define BM_DMA_EARS_EDREQ_0  (0x00000001U) /*!< Bit mask for DMA_EARS_EDREQ_0. */
#define BS_DMA_EARS_EDREQ_0  (1U)          /*!< Bit field size in bits for DMA_EARS_EDREQ_0. */

/*! @brief Read current value of the DMA_EARS_EDREQ_0 field. */
#define BR_DMA_EARS_EDREQ_0(x) (BME_UBFX32(HW_DMA_EARS_ADDR(x), BP_DMA_EARS_EDREQ_0, BS_DMA_EARS_EDREQ_0))

/*! @brief Format value for bitfield DMA_EARS_EDREQ_0. */
#define BF_DMA_EARS_EDREQ_0(v) ((uint32_t)((uint32_t)(v) << BP_DMA_EARS_EDREQ_0) & BM_DMA_EARS_EDREQ_0)

/*! @brief Set the EDREQ_0 field to a new value. */
#define BW_DMA_EARS_EDREQ_0(x, v) (BME_BFI32(HW_DMA_EARS_ADDR(x), ((uint32_t)(v) << BP_DMA_EARS_EDREQ_0), BP_DMA_EARS_EDREQ_0, 1))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_1[1] (RW)
 *
 * Values:
 * - 0 - Disable asynchronous DMA request for channel 1
 * - 1 - Enable asynchronous DMA request for channel 1.
 */
/*@{*/
#define BP_DMA_EARS_EDREQ_1  (1U)          /*!< Bit position for DMA_EARS_EDREQ_1. */
#define BM_DMA_EARS_EDREQ_1  (0x00000002U) /*!< Bit mask for DMA_EARS_EDREQ_1. */
#define BS_DMA_EARS_EDREQ_1  (1U)          /*!< Bit field size in bits for DMA_EARS_EDREQ_1. */

/*! @brief Read current value of the DMA_EARS_EDREQ_1 field. */
#define BR_DMA_EARS_EDREQ_1(x) (BME_UBFX32(HW_DMA_EARS_ADDR(x), BP_DMA_EARS_EDREQ_1, BS_DMA_EARS_EDREQ_1))

/*! @brief Format value for bitfield DMA_EARS_EDREQ_1. */
#define BF_DMA_EARS_EDREQ_1(v) ((uint32_t)((uint32_t)(v) << BP_DMA_EARS_EDREQ_1) & BM_DMA_EARS_EDREQ_1)

