theatrus/ksdk/platform/CMSIS/Include/device/MKV10Z7/MKV10Z7_registers.h
/*! @brief Set the COMPAREH field to a new value. */
#define BW_EWM_CMPH_COMPAREH(x, v) (HW_EWM_CMPH_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_EWM_CLKCTRL - Clock Control Register
 ******************************************************************************/

/*!
 * @brief HW_EWM_CLKCTRL - Clock Control Register (RW)
 *
 * Reset value: 0x00U
 *
 * This CLKCTRL register is reset to 0x00 after a CPU reset. This register can
 * be written only once after a CPU reset. Writing this register more than once
 * generates a bus transfer error. User should select the required low power clock
 * before enabling the EWM.
 */
typedef union _hw_ewm_clkctrl
{
    uint8_t U;
    struct _hw_ewm_clkctrl_bitfields
    {
        uint8_t CLKSEL : 2;            /*!< [1:0]  */
        uint8_t RESERVED0 : 6;         /*!< [7:2]  */
    } B;
} hw_ewm_clkctrl_t;

/*!
 * @name Constants and macros for entire EWM_CLKCTRL register
 */
/*@{*/
#define HW_EWM_CLKCTRL_ADDR(x)   ((uint32_t)(x) + 0x4U)

#define HW_EWM_CLKCTRL(x)        (*(__IO hw_ewm_clkctrl_t *) HW_EWM_CLKCTRL_ADDR(x))
#define HW_EWM_CLKCTRL_RD(x)     (HW_EWM_CLKCTRL(x).U)
#define HW_EWM_CLKCTRL_WR(x, v)  (HW_EWM_CLKCTRL(x).U = (v))
#define HW_EWM_CLKCTRL_SET(x, v) (BME_OR8(HW_EWM_CLKCTRL_ADDR(x), (uint8_t)(v)))
#define HW_EWM_CLKCTRL_CLR(x, v) (BME_AND8(HW_EWM_CLKCTRL_ADDR(x), (uint8_t)(~(v))))
#define HW_EWM_CLKCTRL_TOG(x, v) (BME_XOR8(HW_EWM_CLKCTRL_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual EWM_CLKCTRL bitfields
 */

/*!
 * @name Register EWM_CLKCTRL, field CLKSEL[1:0] (RW)
 *
 * EWM has 4 possible low power clock sources for running EWM counter. One of
 * the clock source can be selected by writing into this field. 00 - lpo_clk[0]
 * will be selected for running EWM counter. 01 - lpo_clk[1] will be selected for
 * running EWM counter. 10 - lpo_clk[2] will be selected for running EWM counter.
 * 11 - lpo_clk[3] will be selected for running EWM counter.
 */
/*@{*/
#define BP_EWM_CLKCTRL_CLKSEL (0U)         /*!< Bit position for EWM_CLKCTRL_CLKSEL. */
#define BM_EWM_CLKCTRL_CLKSEL (0x03U)      /*!< Bit mask for EWM_CLKCTRL_CLKSEL. */
#define BS_EWM_CLKCTRL_CLKSEL (2U)         /*!< Bit field size in bits for EWM_CLKCTRL_CLKSEL. */

/*! @brief Read current value of the EWM_CLKCTRL_CLKSEL field. */
#define BR_EWM_CLKCTRL_CLKSEL(x) (BME_UBFX8(HW_EWM_CLKCTRL_ADDR(x), BP_EWM_CLKCTRL_CLKSEL, BS_EWM_CLKCTRL_CLKSEL))

/*! @brief Format value for bitfield EWM_CLKCTRL_CLKSEL. */
#define BF_EWM_CLKCTRL_CLKSEL(v) ((uint8_t)((uint8_t)(v) << BP_EWM_CLKCTRL_CLKSEL) & BM_EWM_CLKCTRL_CLKSEL)

/*! @brief Set the CLKSEL field to a new value. */
#define BW_EWM_CLKCTRL_CLKSEL(x, v) (BME_BFI8(HW_EWM_CLKCTRL_ADDR(x), ((uint8_t)(v) << BP_EWM_CLKCTRL_CLKSEL), BP_EWM_CLKCTRL_CLKSEL, 2))
/*@}*/

/*******************************************************************************
 * HW_EWM_CLKPRESCALER - Clock Prescaler Register
 ******************************************************************************/

/*!
 * @brief HW_EWM_CLKPRESCALER - Clock Prescaler Register (RW)
 *
 * Reset value: 0x00U
 *
 * This CLKPRESCALER register is reset to 0x00 after a CPU reset. This register
 * can be written only once after a CPU reset. Writing this register more than
 * once generates a bus transfer error. Write the required prescaler value before
 * enabling the EWM. The implementation of this register is chip-specific. See the
 * Chip Configuration details.
 */
typedef union _hw_ewm_clkprescaler
{
    uint8_t U;
    struct _hw_ewm_clkprescaler_bitfields
    {
        uint8_t CLK_DIV : 8;           /*!< [7:0]  */
    } B;
} hw_ewm_clkprescaler_t;

/*!
 * @name Constants and macros for entire EWM_CLKPRESCALER register
 */
/*@{*/
#define HW_EWM_CLKPRESCALER_ADDR(x) ((uint32_t)(x) + 0x5U)

#define HW_EWM_CLKPRESCALER(x)   (*(__IO hw_ewm_clkprescaler_t *) HW_EWM_CLKPRESCALER_ADDR(x))
#define HW_EWM_CLKPRESCALER_RD(x) (HW_EWM_CLKPRESCALER(x).U)
#define HW_EWM_CLKPRESCALER_WR(x, v) (HW_EWM_CLKPRESCALER(x).U = (v))
#define HW_EWM_CLKPRESCALER_SET(x, v) (BME_OR8(HW_EWM_CLKPRESCALER_ADDR(x), (uint8_t)(v)))
#define HW_EWM_CLKPRESCALER_CLR(x, v) (BME_AND8(HW_EWM_CLKPRESCALER_ADDR(x), (uint8_t)(~(v))))
#define HW_EWM_CLKPRESCALER_TOG(x, v) (BME_XOR8(HW_EWM_CLKPRESCALER_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual EWM_CLKPRESCALER bitfields
 */

/*!
 * @name Register EWM_CLKPRESCALER, field CLK_DIV[7:0] (RW)
 *
 * Selected low power source for running the EWM counter can be prescaled as
 * below. Prescaled clock frequency = low power clock source frequency/ ( 1+ CLK_DIV
 * )
 */
/*@{*/
#define BP_EWM_CLKPRESCALER_CLK_DIV (0U)   /*!< Bit position for EWM_CLKPRESCALER_CLK_DIV. */
#define BM_EWM_CLKPRESCALER_CLK_DIV (0xFFU) /*!< Bit mask for EWM_CLKPRESCALER_CLK_DIV. */
#define BS_EWM_CLKPRESCALER_CLK_DIV (8U)   /*!< Bit field size in bits for EWM_CLKPRESCALER_CLK_DIV. */

/*! @brief Read current value of the EWM_CLKPRESCALER_CLK_DIV field. */
#define BR_EWM_CLKPRESCALER_CLK_DIV(x) (HW_EWM_CLKPRESCALER(x).U)

/*! @brief Format value for bitfield EWM_CLKPRESCALER_CLK_DIV. */
#define BF_EWM_CLKPRESCALER_CLK_DIV(v) ((uint8_t)((uint8_t)(v) << BP_EWM_CLKPRESCALER_CLK_DIV) & BM_EWM_CLKPRESCALER_CLK_DIV)

/*! @brief Set the CLK_DIV field to a new value. */
#define BW_EWM_CLKPRESCALER_CLK_DIV(x, v) (HW_EWM_CLKPRESCALER_WR(x, v))
/*@}*/

/*******************************************************************************
 * hw_ewm_t - module struct
 ******************************************************************************/
/*!
 * @brief All EWM module registers.
 */
#pragma pack(1)
typedef struct _hw_ewm
{
    __IO hw_ewm_ctrl_t CTRL;               /*!< [0x0] Control Register */
    __O hw_ewm_serv_t SERV;                /*!< [0x1] Service Register */
    __IO hw_ewm_cmpl_t CMPL;               /*!< [0x2] Compare Low Register */
    __IO hw_ewm_cmph_t CMPH;               /*!< [0x3] Compare High Register */
    __IO hw_ewm_clkctrl_t CLKCTRL;         /*!< [0x4] Clock Control Register */
    __IO hw_ewm_clkprescaler_t CLKPRESCALER; /*!< [0x5] Clock Prescaler Register */
} hw_ewm_t;
#pragma pack()

/*! @brief Macro to access all EWM registers. */
/*! @param x EWM module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_EWM_REGS(EWM_BASE)</code>. */
#define HW_EWM_REGS(x) (*(hw_ewm_t *)(x))

