theatrus/ksdk/platform/CMSIS/Include/device/MKV10Z7/MKV10Z7_registers.h
/*******************************************************************************
 * hw_mcm_t - module struct
 ******************************************************************************/
/*!
 * @brief All MCM module registers.
 */
#pragma pack(1)
typedef struct _hw_mcm
{
    uint8_t _reserved0[8];
    __I hw_mcm_plasc_t PLASC;              /*!< [0x8] Crossbar Switch (AXBS) Slave Configuration */
    __I hw_mcm_plamc_t PLAMC;              /*!< [0xA] Crossbar Switch (AXBS) Master Configuration */
    __IO hw_mcm_placr_t PLACR;             /*!< [0xC] Platform Control Register */
    uint8_t _reserved1[48];
    __IO hw_mcm_cpo_t CPO;                 /*!< [0x40] Compute Operation Control Register */
} hw_mcm_t;
#pragma pack()

/*! @brief Macro to access all MCM registers. */
/*! @param x MCM module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_MCM_REGS(MCM_BASE)</code>. */
#define HW_MCM_REGS(x) (*(hw_mcm_t *)(x))

/*
 * MKV10Z7 MMDVSQ
 *
 * Memory-Mapped Divide and Square Root
 *
 * Registers defined in this header file:
 * - HW_MMDVSQ_DEND - Dividend Register
 * - HW_MMDVSQ_DSOR - Divisor Register
 * - HW_MMDVSQ_CSR - Control/Status Register
 * - HW_MMDVSQ_RES - Result Register
 * - HW_MMDVSQ_RCND - Radicand Register
 *
 * - hw_mmdvsq_t - Struct containing all module registers.
 */

#define HW_MMDVSQ_INSTANCE_COUNT (1U) /*!< Number of instances of the MMDVSQ module. */
#define HW_MMDVSQ (0U) /*!< Instance number for MMDVSQ. */

/*******************************************************************************
 * HW_MMDVSQ_DEND - Dividend Register
 ******************************************************************************/

/*!
 * @brief HW_MMDVSQ_DEND - Dividend Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is loaded with the input dividend operand before a divide
 * operation is initiated. The register is updated by the MMDVSQ hardware during the
 * execution of a divide or square root calculation. Any memory access (read or
 * write) of the DEND register while the module is busy during a calculation causes
 * the access to be stalled (using wait states) until the calculation completes.
 */
typedef union _hw_mmdvsq_dend
{
    uint32_t U;
    struct _hw_mmdvsq_dend_bitfields
    {
        uint32_t DIVIDEND : 32;        /*!< [31:0] Dividend */
    } B;
} hw_mmdvsq_dend_t;

/*!
 * @name Constants and macros for entire MMDVSQ_DEND register
 */
/*@{*/
#define HW_MMDVSQ_DEND_ADDR(x)   ((uint32_t)(x) + 0x0U)

#define HW_MMDVSQ_DEND(x)        (*(__IO hw_mmdvsq_dend_t *) HW_MMDVSQ_DEND_ADDR(x))
#define HW_MMDVSQ_DEND_RD(x)     (HW_MMDVSQ_DEND(x).U)
#define HW_MMDVSQ_DEND_WR(x, v)  (HW_MMDVSQ_DEND(x).U = (v))
#define HW_MMDVSQ_DEND_SET(x, v) (HW_MMDVSQ_DEND_WR(x, HW_MMDVSQ_DEND_RD(x) |  (v)))
#define HW_MMDVSQ_DEND_CLR(x, v) (HW_MMDVSQ_DEND_WR(x, HW_MMDVSQ_DEND_RD(x) & ~(v)))
#define HW_MMDVSQ_DEND_TOG(x, v) (HW_MMDVSQ_DEND_WR(x, HW_MMDVSQ_DEND_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual MMDVSQ_DEND bitfields
 */

/*!
 * @name Register MMDVSQ_DEND, field DIVIDEND[31:0] (RW)
 *
 * This is the input dividend operand for divide calculations.
 */
/*@{*/
#define BP_MMDVSQ_DEND_DIVIDEND (0U)       /*!< Bit position for MMDVSQ_DEND_DIVIDEND. */
#define BM_MMDVSQ_DEND_DIVIDEND (0xFFFFFFFFU) /*!< Bit mask for MMDVSQ_DEND_DIVIDEND. */
#define BS_MMDVSQ_DEND_DIVIDEND (32U)      /*!< Bit field size in bits for MMDVSQ_DEND_DIVIDEND. */

/*! @brief Read current value of the MMDVSQ_DEND_DIVIDEND field. */
#define BR_MMDVSQ_DEND_DIVIDEND(x) (HW_MMDVSQ_DEND(x).U)

/*! @brief Format value for bitfield MMDVSQ_DEND_DIVIDEND. */
#define BF_MMDVSQ_DEND_DIVIDEND(v) ((uint32_t)((uint32_t)(v) << BP_MMDVSQ_DEND_DIVIDEND) & BM_MMDVSQ_DEND_DIVIDEND)

/*! @brief Set the DIVIDEND field to a new value. */
#define BW_MMDVSQ_DEND_DIVIDEND(x, v) (HW_MMDVSQ_DEND_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_MMDVSQ_DSOR - Divisor Register
 ******************************************************************************/

/*!
 * @brief HW_MMDVSQ_DSOR - Divisor Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is loaded with the input divisor operand before a divide
 * operation is initiated. If CSR[DFS] = 0, a write to this register inititates a
 * divide operation. Any memory access (read or write) of the DSOR register while the
 * module is busy during a calculation causes the access to be stalled (using
 * wait states) until the calculation completes. If a divide operation is inititated
 * with DSOR = 0, the hardware signals a divide-by-zero condition and sets RES =
 * 0 and CSR[DZ] = 1. If CSR[DZE] = 1, an attempted read of the RES result is
 * error terminated.
 */
typedef union _hw_mmdvsq_dsor
{
    uint32_t U;
    struct _hw_mmdvsq_dsor_bitfields
    {
        uint32_t DIVISOR : 32;         /*!< [31:0] Divisor */
    } B;
} hw_mmdvsq_dsor_t;

/*!
 * @name Constants and macros for entire MMDVSQ_DSOR register
 */
/*@{*/
#define HW_MMDVSQ_DSOR_ADDR(x)   ((uint32_t)(x) + 0x4U)

#define HW_MMDVSQ_DSOR(x)        (*(__IO hw_mmdvsq_dsor_t *) HW_MMDVSQ_DSOR_ADDR(x))
#define HW_MMDVSQ_DSOR_RD(x)     (HW_MMDVSQ_DSOR(x).U)
#define HW_MMDVSQ_DSOR_WR(x, v)  (HW_MMDVSQ_DSOR(x).U = (v))
#define HW_MMDVSQ_DSOR_SET(x, v) (HW_MMDVSQ_DSOR_WR(x, HW_MMDVSQ_DSOR_RD(x) |  (v)))
#define HW_MMDVSQ_DSOR_CLR(x, v) (HW_MMDVSQ_DSOR_WR(x, HW_MMDVSQ_DSOR_RD(x) & ~(v)))
#define HW_MMDVSQ_DSOR_TOG(x, v) (HW_MMDVSQ_DSOR_WR(x, HW_MMDVSQ_DSOR_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual MMDVSQ_DSOR bitfields
 */

/*!
 * @name Register MMDVSQ_DSOR, field DIVISOR[31:0] (RW)
 *
 * This is the input divisor operand for divide calculations.
 */
/*@{*/
#define BP_MMDVSQ_DSOR_DIVISOR (0U)        /*!< Bit position for MMDVSQ_DSOR_DIVISOR. */
#define BM_MMDVSQ_DSOR_DIVISOR (0xFFFFFFFFU) /*!< Bit mask for MMDVSQ_DSOR_DIVISOR. */
#define BS_MMDVSQ_DSOR_DIVISOR (32U)       /*!< Bit field size in bits for MMDVSQ_DSOR_DIVISOR. */

/*! @brief Read current value of the MMDVSQ_DSOR_DIVISOR field. */
#define BR_MMDVSQ_DSOR_DIVISOR(x) (HW_MMDVSQ_DSOR(x).U)

/*! @brief Format value for bitfield MMDVSQ_DSOR_DIVISOR. */
#define BF_MMDVSQ_DSOR_DIVISOR(v) ((uint32_t)((uint32_t)(v) << BP_MMDVSQ_DSOR_DIVISOR) & BM_MMDVSQ_DSOR_DIVISOR)

/*! @brief Set the DIVISOR field to a new value. */
#define BW_MMDVSQ_DSOR_DIVISOR(x, v) (HW_MMDVSQ_DSOR_WR(x, v))
/*@}*/

