theatrus/ksdk/platform/CMSIS/Include/device/MKV10Z7/MKV10Z7_registers.h
/*******************************************************************************
 * HW_MMDVSQ_CSR - Control/Status Register
 ******************************************************************************/

/*!
 * @brief HW_MMDVSQ_CSR - Control/Status Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register defines the operating configuration of divide operations and
 * provides status information. The upper 3 bits provide busy status indicators,
 * while the low-order byte defines the configuration for divide operations. The
 * read-only status bits in CSR[31:29] are valid for both divide and square root
 * operations; the configuration and status bit in CSR[5:0] are only valid for
 * divides. A memory write access of the CSR register while the module is busy during
 * a calculation causes the access to be stalled (using wait states) until the
 * calculation completes.
 */
typedef union _hw_mmdvsq_csr
{
    uint32_t U;
    struct _hw_mmdvsq_csr_bitfields
    {
        uint32_t SRT : 1;              /*!< [0] Start */
        uint32_t USGN : 1;             /*!< [1] Unsigned calculation */
        uint32_t REM : 1;              /*!< [2] REMainder calculation */
        uint32_t DZE : 1;              /*!< [3] Divide-by-Zero-Enable */
        uint32_t DZ : 1;               /*!< [4] Divide-by-Zero */
        uint32_t DFS : 1;              /*!< [5] Disable Fast Start */
        uint32_t RESERVED0 : 23;       /*!< [28:6]  */
        uint32_t SQRT : 1;             /*!< [29] SQUARE ROOT */
        uint32_t DIV : 1;              /*!< [30] DIVIDE */
        uint32_t BUSY : 1;             /*!< [31] BUSY */
    } B;
} hw_mmdvsq_csr_t;

/*!
 * @name Constants and macros for entire MMDVSQ_CSR register
 */
/*@{*/
#define HW_MMDVSQ_CSR_ADDR(x)    ((uint32_t)(x) + 0x8U)

#define HW_MMDVSQ_CSR(x)         (*(__IO hw_mmdvsq_csr_t *) HW_MMDVSQ_CSR_ADDR(x))
#define HW_MMDVSQ_CSR_RD(x)      (HW_MMDVSQ_CSR(x).U)
#define HW_MMDVSQ_CSR_WR(x, v)   (HW_MMDVSQ_CSR(x).U = (v))
#define HW_MMDVSQ_CSR_SET(x, v)  (HW_MMDVSQ_CSR_WR(x, HW_MMDVSQ_CSR_RD(x) |  (v)))
#define HW_MMDVSQ_CSR_CLR(x, v)  (HW_MMDVSQ_CSR_WR(x, HW_MMDVSQ_CSR_RD(x) & ~(v)))
#define HW_MMDVSQ_CSR_TOG(x, v)  (HW_MMDVSQ_CSR_WR(x, HW_MMDVSQ_CSR_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual MMDVSQ_CSR bitfields
 */

/*!
 * @name Register MMDVSQ_CSR, field SRT[0] (WORZ)
 *
 * When written with a logical one and CSR[DFS] = 1, this flag initiates a
 * divide operation. If written as a logical one with CSR[DFS] = 0, it is ignored.
 * This bit always reads as a zero. The state of the register write data defines
 * this bit's function.
 *
 * Values:
 * - 0 - No operation initiated
 * - 1 - If CSR[DFS] = 1, then initiate a divide calculation, else ignore
 */
/*@{*/
#define BP_MMDVSQ_CSR_SRT    (0U)          /*!< Bit position for MMDVSQ_CSR_SRT. */
#define BM_MMDVSQ_CSR_SRT    (0x00000001U) /*!< Bit mask for MMDVSQ_CSR_SRT. */
#define BS_MMDVSQ_CSR_SRT    (1U)          /*!< Bit field size in bits for MMDVSQ_CSR_SRT. */

/*! @brief Format value for bitfield MMDVSQ_CSR_SRT. */
#define BF_MMDVSQ_CSR_SRT(v) ((uint32_t)((uint32_t)(v) << BP_MMDVSQ_CSR_SRT) & BM_MMDVSQ_CSR_SRT)

/*! @brief Set the SRT field to a new value. */
#define BW_MMDVSQ_CSR_SRT(x, v) (HW_MMDVSQ_CSR_WR(x, (HW_MMDVSQ_CSR_RD(x) & ~BM_MMDVSQ_CSR_SRT) | BF_MMDVSQ_CSR_SRT(v)))
/*@}*/

/*!
 * @name Register MMDVSQ_CSR, field USGN[1] (RW)
 *
 * This indicator selects whether a signed (default) or unsigned divide is
 * performed. See the CSR[REM] description for the encoding of the four possible
 * divide operations.
 *
 * Values:
 * - 0 - Perform a signed divide
 * - 1 - Perform an unsigned divide
 */
/*@{*/
#define BP_MMDVSQ_CSR_USGN   (1U)          /*!< Bit position for MMDVSQ_CSR_USGN. */
#define BM_MMDVSQ_CSR_USGN   (0x00000002U) /*!< Bit mask for MMDVSQ_CSR_USGN. */
#define BS_MMDVSQ_CSR_USGN   (1U)          /*!< Bit field size in bits for MMDVSQ_CSR_USGN. */

/*! @brief Read current value of the MMDVSQ_CSR_USGN field. */
#define BR_MMDVSQ_CSR_USGN(x) (HW_MMDVSQ_CSR(x).B.USGN)

/*! @brief Format value for bitfield MMDVSQ_CSR_USGN. */
#define BF_MMDVSQ_CSR_USGN(v) ((uint32_t)((uint32_t)(v) << BP_MMDVSQ_CSR_USGN) & BM_MMDVSQ_CSR_USGN)

/*! @brief Set the USGN field to a new value. */
#define BW_MMDVSQ_CSR_USGN(x, v) (HW_MMDVSQ_CSR_WR(x, (HW_MMDVSQ_CSR_RD(x) & ~BM_MMDVSQ_CSR_USGN) | BF_MMDVSQ_CSR_USGN(v)))
/*@}*/

/*!
 * @name Register MMDVSQ_CSR, field REM[2] (RW)
 *
 * This indicator selects whether the quotient or the remainder is returned in
 * the RES register. The combined CSR[REM] and CSR[USGN] bits define four possible
 * divide operations: If CSR[REM, USGN] = 0b00, perform a signed divide,
 * returning the quotient If CSR[REM, USGN] = 0b01, perform an unsigned divide,
 * returning the quotient If CSR[REM, USGN] = 0b10, perform a signed divide, returning
 * the remainder If CSR[REM, USGN] = 0b11, perform an unsigned divide, returning
 * the remainder
 *
 * Values:
 * - 0 - Return the quotient in the RES for the divide calculation
 * - 1 - Return the remainder in the RES for the divide calculation
 */
/*@{*/
#define BP_MMDVSQ_CSR_REM    (2U)          /*!< Bit position for MMDVSQ_CSR_REM. */
#define BM_MMDVSQ_CSR_REM    (0x00000004U) /*!< Bit mask for MMDVSQ_CSR_REM. */
#define BS_MMDVSQ_CSR_REM    (1U)          /*!< Bit field size in bits for MMDVSQ_CSR_REM. */

/*! @brief Read current value of the MMDVSQ_CSR_REM field. */
#define BR_MMDVSQ_CSR_REM(x) (HW_MMDVSQ_CSR(x).B.REM)

/*! @brief Format value for bitfield MMDVSQ_CSR_REM. */
#define BF_MMDVSQ_CSR_REM(v) ((uint32_t)((uint32_t)(v) << BP_MMDVSQ_CSR_REM) & BM_MMDVSQ_CSR_REM)

/*! @brief Set the REM field to a new value. */
#define BW_MMDVSQ_CSR_REM(x, v) (HW_MMDVSQ_CSR_WR(x, (HW_MMDVSQ_CSR_RD(x) & ~BM_MMDVSQ_CSR_REM) | BF_MMDVSQ_CSR_REM(v)))
/*@}*/

/*!
 * @name Register MMDVSQ_CSR, field DZE[3] (RW)
 *
 * This indicator configures the MMDVSQ's response to divide-by-zero
 * calculations. If both CSR[DZ] and CSR[DZE] are set, then a subsequent read of the RES
 * register is error terminated to signal the processor of the attempted
 * divide-by-zero.
 *
 * Values:
 * - 0 - Reads of the RES register return the register contents
 * - 1 - If CSR[DZ] = 1, an attempted read of RES register is error terminated
 *     to signal a divide-by-zero, else the register contents are returned
 */
/*@{*/
#define BP_MMDVSQ_CSR_DZE    (3U)          /*!< Bit position for MMDVSQ_CSR_DZE. */
#define BM_MMDVSQ_CSR_DZE    (0x00000008U) /*!< Bit mask for MMDVSQ_CSR_DZE. */
#define BS_MMDVSQ_CSR_DZE    (1U)          /*!< Bit field size in bits for MMDVSQ_CSR_DZE. */

