theatrus/ksdk/platform/CMSIS/Include/device/MKV10Z7/MKV10Z7_registers.h
/*! @brief Read current value of the MMDVSQ_CSR_DZE field. */
#define BR_MMDVSQ_CSR_DZE(x) (HW_MMDVSQ_CSR(x).B.DZE)

/*! @brief Format value for bitfield MMDVSQ_CSR_DZE. */
#define BF_MMDVSQ_CSR_DZE(v) ((uint32_t)((uint32_t)(v) << BP_MMDVSQ_CSR_DZE) & BM_MMDVSQ_CSR_DZE)

/*! @brief Set the DZE field to a new value. */
#define BW_MMDVSQ_CSR_DZE(x, v) (HW_MMDVSQ_CSR_WR(x, (HW_MMDVSQ_CSR_RD(x) & ~BM_MMDVSQ_CSR_DZE) | BF_MMDVSQ_CSR_DZE(v)))
/*@}*/

/*!
 * @name Register MMDVSQ_CSR, field DZ[4] (RO)
 *
 * This read-only status indicator signals the last divide operation had a zero
 * divisor, that is, DSOR = 0x0000_0000. For this case, RES is set to 0x0000_0000
 * and this indicator bit set. After a divide-by-zero operation, a read of the
 * RES register returns either the zero result, or, if CSR[DZE] = 1, terminates
 * the read with an error. The CSR[DZ] indicator is cleared by the hardware at the
 * beginning of each operation.
 *
 * Values:
 * - 0 - The last divide operation had a non-zero divisor, that is, DSOR != 0
 * - 1 - The last divide operation had a zero divisor, that is, DSOR = 0
 */
/*@{*/
#define BP_MMDVSQ_CSR_DZ     (4U)          /*!< Bit position for MMDVSQ_CSR_DZ. */
#define BM_MMDVSQ_CSR_DZ     (0x00000010U) /*!< Bit mask for MMDVSQ_CSR_DZ. */
#define BS_MMDVSQ_CSR_DZ     (1U)          /*!< Bit field size in bits for MMDVSQ_CSR_DZ. */

/*! @brief Read current value of the MMDVSQ_CSR_DZ field. */
#define BR_MMDVSQ_CSR_DZ(x)  (HW_MMDVSQ_CSR(x).B.DZ)
/*@}*/

/*!
 * @name Register MMDVSQ_CSR, field DFS[5] (RW)
 *
 * The MMDVSQ supports two mechanisms for initiating a divide operation. The
 * default mechanism is a "fast start" where a write to the DSOR register begins the
 * divide. Alternatively, the start mechanism can begin after a write to the CSR
 * register with CSR[SRT] set. The CSR[DFS] indicator selects the divide start
 * mechanism.
 *
 * Values:
 * - 0 - A divide operation is initiated by a write to the DSOR register
 * - 1 - A divide operation is initiated by a write to the CSR register with
 *     CSR[SRT] = 1
 */
/*@{*/
#define BP_MMDVSQ_CSR_DFS    (5U)          /*!< Bit position for MMDVSQ_CSR_DFS. */
#define BM_MMDVSQ_CSR_DFS    (0x00000020U) /*!< Bit mask for MMDVSQ_CSR_DFS. */
#define BS_MMDVSQ_CSR_DFS    (1U)          /*!< Bit field size in bits for MMDVSQ_CSR_DFS. */

/*! @brief Read current value of the MMDVSQ_CSR_DFS field. */
#define BR_MMDVSQ_CSR_DFS(x) (HW_MMDVSQ_CSR(x).B.DFS)

/*! @brief Format value for bitfield MMDVSQ_CSR_DFS. */
#define BF_MMDVSQ_CSR_DFS(v) ((uint32_t)((uint32_t)(v) << BP_MMDVSQ_CSR_DFS) & BM_MMDVSQ_CSR_DFS)

/*! @brief Set the DFS field to a new value. */
#define BW_MMDVSQ_CSR_DFS(x, v) (HW_MMDVSQ_CSR_WR(x, (HW_MMDVSQ_CSR_RD(x) & ~BM_MMDVSQ_CSR_DFS) | BF_MMDVSQ_CSR_DFS(v)))
/*@}*/

/*!
 * @name Register MMDVSQ_CSR, field SQRT[29] (RO)
 *
 * Current or last operation was a square root. This read-only indicator bit
 * signals if the current or last operation performed by the MMDVSQ was a square
 * root. The reset state of this indicator is cleared.
 *
 * Values:
 * - 0 - Current or last MMDVSQ operation was not a square root
 * - 1 - Current or last MMDVSQ operation was a square root
 */
/*@{*/
#define BP_MMDVSQ_CSR_SQRT   (29U)         /*!< Bit position for MMDVSQ_CSR_SQRT. */
#define BM_MMDVSQ_CSR_SQRT   (0x20000000U) /*!< Bit mask for MMDVSQ_CSR_SQRT. */
#define BS_MMDVSQ_CSR_SQRT   (1U)          /*!< Bit field size in bits for MMDVSQ_CSR_SQRT. */

/*! @brief Read current value of the MMDVSQ_CSR_SQRT field. */
#define BR_MMDVSQ_CSR_SQRT(x) (HW_MMDVSQ_CSR(x).B.SQRT)
/*@}*/

/*!
 * @name Register MMDVSQ_CSR, field DIV[30] (RO)
 *
 * Current or last operation was a divide. This read-only indicator bit signals
 * if the current or last operation performed by the MMDVSQ was a divide. The
 * reset state of this indicator is set.
 *
 * Values:
 * - 0 - Current or last MMDVSQ operation was not a divide
 * - 1 - Current or last MMDVSQ operation was a divide
 */
/*@{*/
#define BP_MMDVSQ_CSR_DIV    (30U)         /*!< Bit position for MMDVSQ_CSR_DIV. */
#define BM_MMDVSQ_CSR_DIV    (0x40000000U) /*!< Bit mask for MMDVSQ_CSR_DIV. */
#define BS_MMDVSQ_CSR_DIV    (1U)          /*!< Bit field size in bits for MMDVSQ_CSR_DIV. */

/*! @brief Read current value of the MMDVSQ_CSR_DIV field. */
#define BR_MMDVSQ_CSR_DIV(x) (HW_MMDVSQ_CSR(x).B.DIV)
/*@}*/

/*!
 * @name Register MMDVSQ_CSR, field BUSY[31] (RO)
 *
 * This read-only bit is asserted when the MMDVSQ is performing a divide or
 * square root. When an operation is initiated, the hardware sets this flag. It
 * remains asserted until the operation completes and the hardware automatically
 * clears the indicator. This bit can be used to poll the MMDVSQ's execution status.
 * The combined CSR[BUSY, DIV, SQRT] indicators provide an encoded module status:
 * If 0b001, then MMDVSQ is idle and the last calculation was a square root If
 * 0b010, then MMDVSQ is idle and the last calculation was a divide If 0b101, then
 * MMDVSQ is busy processing a square root calculation If 0b110, then MMDVSQ is
 * busy processing a divide calculation The remaining encodings of CSR[BUSY, DIV,
 * SQRT] are reserved.
 *
 * Values:
 * - 0 - MMDVSQ is idle
 * - 1 - MMDVSQ is busy performing a divide or square root calculation
 */
/*@{*/
#define BP_MMDVSQ_CSR_BUSY   (31U)         /*!< Bit position for MMDVSQ_CSR_BUSY. */
#define BM_MMDVSQ_CSR_BUSY   (0x80000000U) /*!< Bit mask for MMDVSQ_CSR_BUSY. */
#define BS_MMDVSQ_CSR_BUSY   (1U)          /*!< Bit field size in bits for MMDVSQ_CSR_BUSY. */

/*! @brief Read current value of the MMDVSQ_CSR_BUSY field. */
#define BR_MMDVSQ_CSR_BUSY(x) (HW_MMDVSQ_CSR(x).B.BUSY)
/*@}*/

/*******************************************************************************
 * HW_MMDVSQ_RES - Result Register
 ******************************************************************************/

/*!
 * @brief HW_MMDVSQ_RES - Result Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is loaded with the result of the divide or square root
 * calculation. It is updated by the MMDVSQ hardware at the completion of the
 * calculation. When a square root operation is performed (on an unsigned 32-bit number),
 * the result is limited to a 16-bit value with RES[31:16] = 0x0000. Any memory
 * access (read or write) of the RES register while the module is busy during a
 * calculation causes the access to be stalled (using wait states) until the
 * calculation completes and the new result written into the register.
 */
typedef union _hw_mmdvsq_res
{
    uint32_t U;
    struct _hw_mmdvsq_res_bitfields
    {
        uint32_t RESULT : 32;          /*!< [31:0] Result */
    } B;
} hw_mmdvsq_res_t;

/*!
 * @name Constants and macros for entire MMDVSQ_RES register
 */
/*@{*/
#define HW_MMDVSQ_RES_ADDR(x)    ((uint32_t)(x) + 0xCU)

#define HW_MMDVSQ_RES(x)         (*(__IO hw_mmdvsq_res_t *) HW_MMDVSQ_RES_ADDR(x))
#define HW_MMDVSQ_RES_RD(x)      (HW_MMDVSQ_RES(x).U)
#define HW_MMDVSQ_RES_WR(x, v)   (HW_MMDVSQ_RES(x).U = (v))
#define HW_MMDVSQ_RES_SET(x, v)  (HW_MMDVSQ_RES_WR(x, HW_MMDVSQ_RES_RD(x) |  (v)))
#define HW_MMDVSQ_RES_CLR(x, v)  (HW_MMDVSQ_RES_WR(x, HW_MMDVSQ_RES_RD(x) & ~(v)))
#define HW_MMDVSQ_RES_TOG(x, v)  (HW_MMDVSQ_RES_WR(x, HW_MMDVSQ_RES_RD(x) ^  (v)))
/*@}*/

