theatrus/ksdk/platform/CMSIS/Include/device/MKV10Z7/MKV10Z7_registers.h
/*
 * Constants & macros for individual MMDVSQ_RES bitfields
 */

/*!
 * @name Register MMDVSQ_RES, field RESULT[31:0] (RW)
 *
 * This is the output result for a divide or square root calculation.
 */
/*@{*/
#define BP_MMDVSQ_RES_RESULT (0U)          /*!< Bit position for MMDVSQ_RES_RESULT. */
#define BM_MMDVSQ_RES_RESULT (0xFFFFFFFFU) /*!< Bit mask for MMDVSQ_RES_RESULT. */
#define BS_MMDVSQ_RES_RESULT (32U)         /*!< Bit field size in bits for MMDVSQ_RES_RESULT. */

/*! @brief Read current value of the MMDVSQ_RES_RESULT field. */
#define BR_MMDVSQ_RES_RESULT(x) (HW_MMDVSQ_RES(x).U)

/*! @brief Format value for bitfield MMDVSQ_RES_RESULT. */
#define BF_MMDVSQ_RES_RESULT(v) ((uint32_t)((uint32_t)(v) << BP_MMDVSQ_RES_RESULT) & BM_MMDVSQ_RES_RESULT)

/*! @brief Set the RESULT field to a new value. */
#define BW_MMDVSQ_RES_RESULT(x, v) (HW_MMDVSQ_RES_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_MMDVSQ_RCND - Radicand Register
 ******************************************************************************/

/*!
 * @brief HW_MMDVSQ_RCND - Radicand Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The write-only radicand register is loaded with the input "square" number. A
 * memory write to this register initiates a square root calculation. A memory
 * write access to the RCND register while the module is busy during a calculation
 * causes the access to be stalled (using wait states) until the calculation
 * completes. An attempted read of this register is error terminated.
 */
typedef union _hw_mmdvsq_rcnd
{
    uint32_t U;
    struct _hw_mmdvsq_rcnd_bitfields
    {
        uint32_t RADICAND : 32;        /*!< [31:0] Radicand */
    } B;
} hw_mmdvsq_rcnd_t;

/*!
 * @name Constants and macros for entire MMDVSQ_RCND register
 */
/*@{*/
#define HW_MMDVSQ_RCND_ADDR(x)   ((uint32_t)(x) + 0x10U)

#define HW_MMDVSQ_RCND(x)        (*(__IO hw_mmdvsq_rcnd_t *) HW_MMDVSQ_RCND_ADDR(x))
#define HW_MMDVSQ_RCND_RD(x)     (HW_MMDVSQ_RCND(x).U)
#define HW_MMDVSQ_RCND_WR(x, v)  (HW_MMDVSQ_RCND(x).U = (v))
#define HW_MMDVSQ_RCND_SET(x, v) (HW_MMDVSQ_RCND_WR(x, HW_MMDVSQ_RCND_RD(x) |  (v)))
#define HW_MMDVSQ_RCND_CLR(x, v) (HW_MMDVSQ_RCND_WR(x, HW_MMDVSQ_RCND_RD(x) & ~(v)))
#define HW_MMDVSQ_RCND_TOG(x, v) (HW_MMDVSQ_RCND_WR(x, HW_MMDVSQ_RCND_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual MMDVSQ_RCND bitfields
 */

/*!
 * @name Register MMDVSQ_RCND, field RADICAND[31:0] (RW)
 *
 * This is the input radicand for a square root calculation, that is, the input
 * "square" number.
 */
/*@{*/
#define BP_MMDVSQ_RCND_RADICAND (0U)       /*!< Bit position for MMDVSQ_RCND_RADICAND. */
#define BM_MMDVSQ_RCND_RADICAND (0xFFFFFFFFU) /*!< Bit mask for MMDVSQ_RCND_RADICAND. */
#define BS_MMDVSQ_RCND_RADICAND (32U)      /*!< Bit field size in bits for MMDVSQ_RCND_RADICAND. */

/*! @brief Read current value of the MMDVSQ_RCND_RADICAND field. */
#define BR_MMDVSQ_RCND_RADICAND(x) (HW_MMDVSQ_RCND(x).U)

/*! @brief Format value for bitfield MMDVSQ_RCND_RADICAND. */
#define BF_MMDVSQ_RCND_RADICAND(v) ((uint32_t)((uint32_t)(v) << BP_MMDVSQ_RCND_RADICAND) & BM_MMDVSQ_RCND_RADICAND)

/*! @brief Set the RADICAND field to a new value. */
#define BW_MMDVSQ_RCND_RADICAND(x, v) (HW_MMDVSQ_RCND_WR(x, v))
/*@}*/

/*******************************************************************************
 * hw_mmdvsq_t - module struct
 ******************************************************************************/
/*!
 * @brief All MMDVSQ module registers.
 */
#pragma pack(1)
typedef struct _hw_mmdvsq
{
    __IO hw_mmdvsq_dend_t DEND;            /*!< [0x0] Dividend Register */
    __IO hw_mmdvsq_dsor_t DSOR;            /*!< [0x4] Divisor Register */
    __IO hw_mmdvsq_csr_t CSR;              /*!< [0x8] Control/Status Register */
    __IO hw_mmdvsq_res_t RES;              /*!< [0xC] Result Register */
    __IO hw_mmdvsq_rcnd_t RCND;            /*!< [0x10] Radicand Register */
} hw_mmdvsq_t;
#pragma pack()

/*! @brief Macro to access all MMDVSQ registers. */
/*! @param x MMDVSQ module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_MMDVSQ_REGS(MMDVSQ_BASE)</code>. */
#define HW_MMDVSQ_REGS(x) (*(hw_mmdvsq_t *)(x))

/*
 * MKV10Z7 MTB
 *
 * Micro Trace Buffer
 *
 * Registers defined in this header file:
 * - HW_MTB_POSITION - MTB Position Register
 * - HW_MTB_MASTER - MTB Master Register
 * - HW_MTB_FLOW - MTB Flow Register
 * - HW_MTB_BASE - MTB Base Register
 * - HW_MTB_MODECTRL - Integration Mode Control Register
 * - HW_MTB_TAGSET - Claim TAG Set Register
 * - HW_MTB_TAGCLEAR - Claim TAG Clear Register
 * - HW_MTB_LOCKACCESS - Lock Access Register
 * - HW_MTB_LOCKSTAT - Lock Status Register
 * - HW_MTB_AUTHSTAT - Authentication Status Register
 * - HW_MTB_DEVICEARCH - Device Architecture Register
 * - HW_MTB_DEVICECFG - Device Configuration Register
 * - HW_MTB_DEVICETYPID - Device Type Identifier Register
 * - HW_MTB_PERIPHID4 - Peripheral ID Register
 * - HW_MTB_PERIPHID5 - Peripheral ID Register
 * - HW_MTB_PERIPHID6 - Peripheral ID Register
 * - HW_MTB_PERIPHID7 - Peripheral ID Register
 * - HW_MTB_PERIPHID0 - Peripheral ID Register
 * - HW_MTB_PERIPHID1 - Peripheral ID Register
 * - HW_MTB_PERIPHID2 - Peripheral ID Register
 * - HW_MTB_PERIPHID3 - Peripheral ID Register
 * - HW_MTB_COMPIDn - Component ID Register
 *
 * - hw_mtb_t - Struct containing all module registers.
 */

#define HW_MTB_INSTANCE_COUNT (1U) /*!< Number of instances of the MTB module. */
#define HW_MTB (0U) /*!< Instance number for MTB. */

/*******************************************************************************
 * HW_MTB_POSITION - MTB Position Register
 ******************************************************************************/

/*!
 * @brief HW_MTB_POSITION - MTB Position Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The MTB_POSITION register contains the Trace Write Address Pointer and Wrap
 * fields. This register can be modified by the explicit programming model writes.
 * It is also automatically updated by the MTB hardware when trace packets are
 * being recorded. The base address of the system RAM in the memory map dictates
 * special consideration for the placement of the MTB. Consider the following
 * guidelines: For the standard configuration where the size of the MTB is <= 25% of
 * the total RAM capacity, it is recommended the MTB be based at the address
 * defined by the MTB_BASE register. The read-only MTB_BASE register is defined by
 * the expression (0x2000_0000 - (RAM_Size/4)). For this configuration, the
 * MTB_POSITION register is initialized to MTB_BASE & 0x0000_7FF8. If the size of the
 * MTB is more than 25% but less than or equal to 50% of the total RAM capacity, it
 * is recommended the MTB be based at address 0x2000_0000. In this
 * configuration, the MTB_POSITION register is initialized to (0x2000_0000 & 0x0000_7FF8) =
 * 0x0000_00000. Following these two suggested placements provides a full-featured
 * circular memory buffer containing program trace packets. In the unlikely event
 * an even larger trace buffer is required, a write-once capacity of 75% of the
 * total RAM capacity can be based at address 0x2000_0000. The MTB_POSITION
 * register is initialized to (0x2000_0000 & 0x0000_7FF8) = 0x0000_0000. However, this
 * configuration cannot support operation as a circular queue and instead
 * requires the use of the MTB_FLOW[WATERMARK] capability to automatically disable
 * tracing or halting the processor as the number of packet writes approach the
 * buffer capacity. See the MTB_FLOW register description for more details.
 */
typedef union _hw_mtb_position
{
    uint32_t U;
    struct _hw_mtb_position_bitfields
    {
        uint32_t RESERVED0 : 2;        /*!< [1:0]  */
        uint32_t WRAP : 1;             /*!< [2] WRAP */
        uint32_t POINTER : 29;         /*!< [31:3] Trace Packet Address Pointer[28:0]
                                        * */
    } B;
} hw_mtb_position_t;

/*!
 * @name Constants and macros for entire MTB_POSITION register
 */
/*@{*/
#define HW_MTB_POSITION_ADDR(x)  ((uint32_t)(x) + 0x0U)

#define HW_MTB_POSITION(x)       (*(__IO hw_mtb_position_t *) HW_MTB_POSITION_ADDR(x))
#define HW_MTB_POSITION_RD(x)    (HW_MTB_POSITION(x).U)
#define HW_MTB_POSITION_WR(x, v) (HW_MTB_POSITION(x).U = (v))
#define HW_MTB_POSITION_SET(x, v) (HW_MTB_POSITION_WR(x, HW_MTB_POSITION_RD(x) |  (v)))
#define HW_MTB_POSITION_CLR(x, v) (HW_MTB_POSITION_WR(x, HW_MTB_POSITION_RD(x) & ~(v)))
#define HW_MTB_POSITION_TOG(x, v) (HW_MTB_POSITION_WR(x, HW_MTB_POSITION_RD(x) ^  (v)))
/*@}*/

