theatrus/ksdk/platform/CMSIS/Include/device/MKV10Z7/MKV10Z7_registers.h
/*
 * Constants & macros for individual SIM_SOPT1 bitfields
 */

/*!
 * @name Register SIM_SOPT1, field OSC32KSEL[19:18] (RW)
 *
 * Selects the 32 kHz clock source (ERCLK32K) for LPTMR. This field is reset
 * only for POR/LVD.
 *
 * Values:
 * - 00 - System oscillator (OSC32KCLK)
 * - 01 - Reserved
 * - 10 - Reserved
 * - 11 - LPO 1 kHz
 */
/*@{*/
#define BP_SIM_SOPT1_OSC32KSEL (18U)       /*!< Bit position for SIM_SOPT1_OSC32KSEL. */
#define BM_SIM_SOPT1_OSC32KSEL (0x000C0000U) /*!< Bit mask for SIM_SOPT1_OSC32KSEL. */
#define BS_SIM_SOPT1_OSC32KSEL (2U)        /*!< Bit field size in bits for SIM_SOPT1_OSC32KSEL. */

/*! @brief Read current value of the SIM_SOPT1_OSC32KSEL field. */
#define BR_SIM_SOPT1_OSC32KSEL(x) (BME_UBFX32(HW_SIM_SOPT1_ADDR(x), BP_SIM_SOPT1_OSC32KSEL, BS_SIM_SOPT1_OSC32KSEL))

/*! @brief Format value for bitfield SIM_SOPT1_OSC32KSEL. */
#define BF_SIM_SOPT1_OSC32KSEL(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT1_OSC32KSEL) & BM_SIM_SOPT1_OSC32KSEL)

/*! @brief Set the OSC32KSEL field to a new value. */
#define BW_SIM_SOPT1_OSC32KSEL(x, v) (BME_BFI32(HW_SIM_SOPT1_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT1_OSC32KSEL), BP_SIM_SOPT1_OSC32KSEL, 2))
/*@}*/

/*******************************************************************************
 * HW_SIM_SOPT2 - System Options Register 2
 ******************************************************************************/

/*!
 * @brief HW_SIM_SOPT2 - System Options Register 2 (RW)
 *
 * Reset value: 0x00000000U
 *
 * SOPT2 contains the controls for selecting many of the module clock source
 * options on this device. See the Clock Distribution chapter for more information
 * including clocking diagrams and definitions of device clocks.
 */
typedef union _hw_sim_sopt2
{
    uint32_t U;
    struct _hw_sim_sopt2_bitfields
    {
        uint32_t RESERVED0 : 5;        /*!< [4:0]  */
        uint32_t CLKOUTSEL : 3;        /*!< [7:5] CLKOUT Select */
        uint32_t RESERVED1 : 16;       /*!< [23:8]  */
        uint32_t FTMFFCLKSEL : 2;      /*!< [25:24] FTM Fixed Frequency Clock
                                        * Select */
        uint32_t RESERVED2 : 6;        /*!< [31:26]  */
    } B;
} hw_sim_sopt2_t;

/*!
 * @name Constants and macros for entire SIM_SOPT2 register
 */
/*@{*/
#define HW_SIM_SOPT2_ADDR(x)     ((uint32_t)(x) + 0x1004U)

#define HW_SIM_SOPT2(x)          (*(__IO hw_sim_sopt2_t *) HW_SIM_SOPT2_ADDR(x))
#define HW_SIM_SOPT2_RD(x)       (HW_SIM_SOPT2(x).U)
#define HW_SIM_SOPT2_WR(x, v)    (HW_SIM_SOPT2(x).U = (v))
#define HW_SIM_SOPT2_SET(x, v)   (BME_OR32(HW_SIM_SOPT2_ADDR(x), (uint32_t)(v)))
#define HW_SIM_SOPT2_CLR(x, v)   (BME_AND32(HW_SIM_SOPT2_ADDR(x), (uint32_t)(~(v))))
#define HW_SIM_SOPT2_TOG(x, v)   (BME_XOR32(HW_SIM_SOPT2_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual SIM_SOPT2 bitfields
 */

/*!
 * @name Register SIM_SOPT2, field CLKOUTSEL[7:5] (RW)
 *
 * Selects the clock to output on the CLKOUT pin.
 *
 * Values:
 * - 000 - Reserved
 * - 001 - Reserved
 * - 010 - Bus clock
 * - 011 - LPO clock (1 kHz)
 * - 100 - MCGIRCLK
 * - 101 - Reserved
 * - 110 - OSCERCLK
 * - 111 - Reserved
 */
/*@{*/
#define BP_SIM_SOPT2_CLKOUTSEL (5U)        /*!< Bit position for SIM_SOPT2_CLKOUTSEL. */
#define BM_SIM_SOPT2_CLKOUTSEL (0x000000E0U) /*!< Bit mask for SIM_SOPT2_CLKOUTSEL. */
#define BS_SIM_SOPT2_CLKOUTSEL (3U)        /*!< Bit field size in bits for SIM_SOPT2_CLKOUTSEL. */

/*! @brief Read current value of the SIM_SOPT2_CLKOUTSEL field. */
#define BR_SIM_SOPT2_CLKOUTSEL(x) (BME_UBFX32(HW_SIM_SOPT2_ADDR(x), BP_SIM_SOPT2_CLKOUTSEL, BS_SIM_SOPT2_CLKOUTSEL))

/*! @brief Format value for bitfield SIM_SOPT2_CLKOUTSEL. */
#define BF_SIM_SOPT2_CLKOUTSEL(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT2_CLKOUTSEL) & BM_SIM_SOPT2_CLKOUTSEL)

/*! @brief Set the CLKOUTSEL field to a new value. */
#define BW_SIM_SOPT2_CLKOUTSEL(x, v) (BME_BFI32(HW_SIM_SOPT2_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT2_CLKOUTSEL), BP_SIM_SOPT2_CLKOUTSEL, 3))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field FTMFFCLKSEL[25:24] (RW)
 *
 * Selects the fixed frequency clock for FTM0, FTM1, and FTM2.
 *
 * Values:
 * - 00 - MCGFFCLK
 * - 01 - MCGIRCLK
 * - 10 - OSCERCLK
 * - 11 - MCGFFCLK
 */
/*@{*/
#define BP_SIM_SOPT2_FTMFFCLKSEL (24U)     /*!< Bit position for SIM_SOPT2_FTMFFCLKSEL. */
#define BM_SIM_SOPT2_FTMFFCLKSEL (0x03000000U) /*!< Bit mask for SIM_SOPT2_FTMFFCLKSEL. */
#define BS_SIM_SOPT2_FTMFFCLKSEL (2U)      /*!< Bit field size in bits for SIM_SOPT2_FTMFFCLKSEL. */

/*! @brief Read current value of the SIM_SOPT2_FTMFFCLKSEL field. */
#define BR_SIM_SOPT2_FTMFFCLKSEL(x) (BME_UBFX32(HW_SIM_SOPT2_ADDR(x), BP_SIM_SOPT2_FTMFFCLKSEL, BS_SIM_SOPT2_FTMFFCLKSEL))

/*! @brief Format value for bitfield SIM_SOPT2_FTMFFCLKSEL. */
#define BF_SIM_SOPT2_FTMFFCLKSEL(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT2_FTMFFCLKSEL) & BM_SIM_SOPT2_FTMFFCLKSEL)

/*! @brief Set the FTMFFCLKSEL field to a new value. */
#define BW_SIM_SOPT2_FTMFFCLKSEL(x, v) (BME_BFI32(HW_SIM_SOPT2_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT2_FTMFFCLKSEL), BP_SIM_SOPT2_FTMFFCLKSEL, 2))
/*@}*/

/*******************************************************************************
 * HW_SIM_SOPT4 - System Options Register 4
 ******************************************************************************/

/*!
 * @brief HW_SIM_SOPT4 - System Options Register 4 (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_sim_sopt4
{
    uint32_t U;
    struct _hw_sim_sopt4_bitfields
    {
        uint32_t FTM0FLT0 : 1;         /*!< [0] FTM0 Fault 0 Select */
        uint32_t FTM0FLT1 : 1;         /*!< [1] FTM0 Fault 1 Select */
        uint32_t FTM1FLT0 : 1;         /*!< [2] FTM1 Fault 0 Select */
        uint32_t FTM2FLT0 : 1;         /*!< [3] FTM2 Fault 0 Select */
        uint32_t RESERVED0 : 3;        /*!< [6:4]  */
        uint32_t FTM0TRG0SRC : 1;      /*!< [7] FlexTimer 0 Hardware Trigger 0
                                        * Source Select */
        uint32_t FTM0TRG1SRC : 1;      /*!< [8] FlexTimer 0 Hardware Trigger 1
                                        * Source Select */
        uint32_t FTM0TRG2SRC : 1;      /*!< [9] FlexTimer 0 Hardware Trigger 2
                                        * Source Select */
        uint32_t FTM1TRG0SRC : 1;      /*!< [10] FlexTimer 1 Hardware Trigger 0
                                        * Source Select */
        uint32_t FTM1TRG1SRC : 1;      /*!< [11] FlexTimer 1 Hardware Trigger 1
                                        * Source Select */
        uint32_t FTM1TRG2SRC : 1;      /*!< [12] FlexTimer 1 Hardware Trigger 2
                                        * Source Select */
        uint32_t FTM2TRG0SRC : 1;      /*!< [13] FlexTimer 2 Hardware Trigger 0
                                        * Source Select */
        uint32_t FTM2TRG1SRC : 1;      /*!< [14] FlexTimer 2 Hardware Trigger 1
                                        * Source Select */
        uint32_t FTM2TRG2SRC : 1;      /*!< [15] FlexTimer 2 Hardware Trigger 2
                                        * Source Select */
        uint32_t RESERVED1 : 2;        /*!< [17:16]  */
        uint32_t FTM1ICH0SRC : 2;      /*!< [19:18] FTM1 Channel 0 Input Capture
                                        * Source Select */
        uint32_t FTM2ICH0SRC : 2;      /*!< [21:20] FTM2 Channel 0 Input Capture
                                        * Source Select */
        uint32_t FTM2ICH1SRC : 1;      /*!< [22] FTM2 Channel 1 Input Capture
                                        * Source Select */
        uint32_t RESERVED2 : 1;        /*!< [23]  */
        uint32_t FTM0CLKSEL : 2;       /*!< [25:24] FTM0 External Clock Pin Select
                                        * */
        uint32_t FTM1CLKSEL : 2;       /*!< [27:26] FTM1 External Clock Pin Select
                                        * */
        uint32_t FTM2CLKSEL : 2;       /*!< [29:28] FTM2 External Clock Pin Select
                                        * */
        uint32_t RESERVED3 : 2;        /*!< [31:30]  */
    } B;
} hw_sim_sopt4_t;

/*!
 * @name Constants and macros for entire SIM_SOPT4 register
 */
/*@{*/
#define HW_SIM_SOPT4_ADDR(x)     ((uint32_t)(x) + 0x100CU)

