theatrus/ksdk/platform/CMSIS/Include/device/MKV10Z7/MKV10Z7_registers.h
/*! @brief Set the FTM0TRG0SRC field to a new value. */
#define BW_SIM_SOPT4_FTM0TRG0SRC(x, v) (BME_BFI32(HW_SIM_SOPT4_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT4_FTM0TRG0SRC), BP_SIM_SOPT4_FTM0TRG0SRC, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM0TRG1SRC[8] (RW)
 *
 * Selects the source of FTM0 hardware trigger 1.
 *
 * Values:
 * - 0 - PDB channel 1 trigger drives FTM0 hardware trigger 1
 * - 1 - FTM2 channel match drives FTM0 hardware trigger 1
 */
/*@{*/
#define BP_SIM_SOPT4_FTM0TRG1SRC (8U)      /*!< Bit position for SIM_SOPT4_FTM0TRG1SRC. */
#define BM_SIM_SOPT4_FTM0TRG1SRC (0x00000100U) /*!< Bit mask for SIM_SOPT4_FTM0TRG1SRC. */
#define BS_SIM_SOPT4_FTM0TRG1SRC (1U)      /*!< Bit field size in bits for SIM_SOPT4_FTM0TRG1SRC. */

/*! @brief Read current value of the SIM_SOPT4_FTM0TRG1SRC field. */
#define BR_SIM_SOPT4_FTM0TRG1SRC(x) (BME_UBFX32(HW_SIM_SOPT4_ADDR(x), BP_SIM_SOPT4_FTM0TRG1SRC, BS_SIM_SOPT4_FTM0TRG1SRC))

/*! @brief Format value for bitfield SIM_SOPT4_FTM0TRG1SRC. */
#define BF_SIM_SOPT4_FTM0TRG1SRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT4_FTM0TRG1SRC) & BM_SIM_SOPT4_FTM0TRG1SRC)

/*! @brief Set the FTM0TRG1SRC field to a new value. */
#define BW_SIM_SOPT4_FTM0TRG1SRC(x, v) (BME_BFI32(HW_SIM_SOPT4_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT4_FTM0TRG1SRC), BP_SIM_SOPT4_FTM0TRG1SRC, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM0TRG2SRC[9] (RW)
 *
 * Selects the source of FTM0 hardware trigger 2.
 *
 * Values:
 * - 0 - HSCMP0 output drives FTM0 hardware trigger 2
 * - 1 - HSCMP1 output drives FTM0 hardware trigger 2
 */
/*@{*/
#define BP_SIM_SOPT4_FTM0TRG2SRC (9U)      /*!< Bit position for SIM_SOPT4_FTM0TRG2SRC. */
#define BM_SIM_SOPT4_FTM0TRG2SRC (0x00000200U) /*!< Bit mask for SIM_SOPT4_FTM0TRG2SRC. */
#define BS_SIM_SOPT4_FTM0TRG2SRC (1U)      /*!< Bit field size in bits for SIM_SOPT4_FTM0TRG2SRC. */

/*! @brief Read current value of the SIM_SOPT4_FTM0TRG2SRC field. */
#define BR_SIM_SOPT4_FTM0TRG2SRC(x) (BME_UBFX32(HW_SIM_SOPT4_ADDR(x), BP_SIM_SOPT4_FTM0TRG2SRC, BS_SIM_SOPT4_FTM0TRG2SRC))

/*! @brief Format value for bitfield SIM_SOPT4_FTM0TRG2SRC. */
#define BF_SIM_SOPT4_FTM0TRG2SRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT4_FTM0TRG2SRC) & BM_SIM_SOPT4_FTM0TRG2SRC)

/*! @brief Set the FTM0TRG2SRC field to a new value. */
#define BW_SIM_SOPT4_FTM0TRG2SRC(x, v) (BME_BFI32(HW_SIM_SOPT4_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT4_FTM0TRG2SRC), BP_SIM_SOPT4_FTM0TRG2SRC, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM1TRG0SRC[10] (RW)
 *
 * Selects the source of FTM1 hardware trigger 0.
 *
 * Values:
 * - 0 - HSCMP0 output drives FTM1 hardware trigger 0
 * - 1 - FTM0 channel match drives FTM1 hardware trigger 0
 */
/*@{*/
#define BP_SIM_SOPT4_FTM1TRG0SRC (10U)     /*!< Bit position for SIM_SOPT4_FTM1TRG0SRC. */
#define BM_SIM_SOPT4_FTM1TRG0SRC (0x00000400U) /*!< Bit mask for SIM_SOPT4_FTM1TRG0SRC. */
#define BS_SIM_SOPT4_FTM1TRG0SRC (1U)      /*!< Bit field size in bits for SIM_SOPT4_FTM1TRG0SRC. */

/*! @brief Read current value of the SIM_SOPT4_FTM1TRG0SRC field. */
#define BR_SIM_SOPT4_FTM1TRG0SRC(x) (BME_UBFX32(HW_SIM_SOPT4_ADDR(x), BP_SIM_SOPT4_FTM1TRG0SRC, BS_SIM_SOPT4_FTM1TRG0SRC))

/*! @brief Format value for bitfield SIM_SOPT4_FTM1TRG0SRC. */
#define BF_SIM_SOPT4_FTM1TRG0SRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT4_FTM1TRG0SRC) & BM_SIM_SOPT4_FTM1TRG0SRC)

/*! @brief Set the FTM1TRG0SRC field to a new value. */
#define BW_SIM_SOPT4_FTM1TRG0SRC(x, v) (BME_BFI32(HW_SIM_SOPT4_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT4_FTM1TRG0SRC), BP_SIM_SOPT4_FTM1TRG0SRC, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM1TRG1SRC[11] (RW)
 *
 * Selects the source of FTM1 hardware trigger 1.
 *
 * Values:
 * - 0 - PDB channel 1 trigger drives FTM1 hardware trigger 1
 * - 1 - FTM2 channel match drives FTM1 hardware trigger 1
 */
/*@{*/
#define BP_SIM_SOPT4_FTM1TRG1SRC (11U)     /*!< Bit position for SIM_SOPT4_FTM1TRG1SRC. */
#define BM_SIM_SOPT4_FTM1TRG1SRC (0x00000800U) /*!< Bit mask for SIM_SOPT4_FTM1TRG1SRC. */
#define BS_SIM_SOPT4_FTM1TRG1SRC (1U)      /*!< Bit field size in bits for SIM_SOPT4_FTM1TRG1SRC. */

/*! @brief Read current value of the SIM_SOPT4_FTM1TRG1SRC field. */
#define BR_SIM_SOPT4_FTM1TRG1SRC(x) (BME_UBFX32(HW_SIM_SOPT4_ADDR(x), BP_SIM_SOPT4_FTM1TRG1SRC, BS_SIM_SOPT4_FTM1TRG1SRC))

/*! @brief Format value for bitfield SIM_SOPT4_FTM1TRG1SRC. */
#define BF_SIM_SOPT4_FTM1TRG1SRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT4_FTM1TRG1SRC) & BM_SIM_SOPT4_FTM1TRG1SRC)

/*! @brief Set the FTM1TRG1SRC field to a new value. */
#define BW_SIM_SOPT4_FTM1TRG1SRC(x, v) (BME_BFI32(HW_SIM_SOPT4_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT4_FTM1TRG1SRC), BP_SIM_SOPT4_FTM1TRG1SRC, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM1TRG2SRC[12] (RW)
 *
 * Selects the source of FTM1 hardware trigger 2.
 *
 * Values:
 * - 0 - HSCMP0 output drives FTM1 hardware trigger 2
 * - 1 - HSCMP1 output drives FTM1 hardware trigger 2
 */
/*@{*/
#define BP_SIM_SOPT4_FTM1TRG2SRC (12U)     /*!< Bit position for SIM_SOPT4_FTM1TRG2SRC. */
#define BM_SIM_SOPT4_FTM1TRG2SRC (0x00001000U) /*!< Bit mask for SIM_SOPT4_FTM1TRG2SRC. */
#define BS_SIM_SOPT4_FTM1TRG2SRC (1U)      /*!< Bit field size in bits for SIM_SOPT4_FTM1TRG2SRC. */

/*! @brief Read current value of the SIM_SOPT4_FTM1TRG2SRC field. */
#define BR_SIM_SOPT4_FTM1TRG2SRC(x) (BME_UBFX32(HW_SIM_SOPT4_ADDR(x), BP_SIM_SOPT4_FTM1TRG2SRC, BS_SIM_SOPT4_FTM1TRG2SRC))

/*! @brief Format value for bitfield SIM_SOPT4_FTM1TRG2SRC. */
#define BF_SIM_SOPT4_FTM1TRG2SRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT4_FTM1TRG2SRC) & BM_SIM_SOPT4_FTM1TRG2SRC)

/*! @brief Set the FTM1TRG2SRC field to a new value. */
#define BW_SIM_SOPT4_FTM1TRG2SRC(x, v) (BME_BFI32(HW_SIM_SOPT4_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT4_FTM1TRG2SRC), BP_SIM_SOPT4_FTM1TRG2SRC, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM2TRG0SRC[13] (RW)
 *
 * Selects the source of FTM2 hardware trigger 0.
 *
 * Values:
 * - 0 - HSCMP0 output drives FTM2 hardware trigger 0
 * - 1 - FTM0 channel match drives FTM2 hardware trigger 0
 */
/*@{*/
#define BP_SIM_SOPT4_FTM2TRG0SRC (13U)     /*!< Bit position for SIM_SOPT4_FTM2TRG0SRC. */
#define BM_SIM_SOPT4_FTM2TRG0SRC (0x00002000U) /*!< Bit mask for SIM_SOPT4_FTM2TRG0SRC. */
#define BS_SIM_SOPT4_FTM2TRG0SRC (1U)      /*!< Bit field size in bits for SIM_SOPT4_FTM2TRG0SRC. */

