theatrus/ksdk/platform/CMSIS/Include/device/MKV10Z7/MKV10Z7_registers.h
/*! @brief Read current value of the SIM_SOPT4_FTM2TRG0SRC field. */
#define BR_SIM_SOPT4_FTM2TRG0SRC(x) (BME_UBFX32(HW_SIM_SOPT4_ADDR(x), BP_SIM_SOPT4_FTM2TRG0SRC, BS_SIM_SOPT4_FTM2TRG0SRC))

/*! @brief Format value for bitfield SIM_SOPT4_FTM2TRG0SRC. */
#define BF_SIM_SOPT4_FTM2TRG0SRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT4_FTM2TRG0SRC) & BM_SIM_SOPT4_FTM2TRG0SRC)

/*! @brief Set the FTM2TRG0SRC field to a new value. */
#define BW_SIM_SOPT4_FTM2TRG0SRC(x, v) (BME_BFI32(HW_SIM_SOPT4_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT4_FTM2TRG0SRC), BP_SIM_SOPT4_FTM2TRG0SRC, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM2TRG1SRC[14] (RW)
 *
 * Selects the source of FTM2 hardware trigger 1.
 *
 * Values:
 * - 0 - PDB output trigger 1 drives FTM2 hardware trigger 1
 * - 1 - FTM1 channel match drives FTM2 hardware trigger 1
 */
/*@{*/
#define BP_SIM_SOPT4_FTM2TRG1SRC (14U)     /*!< Bit position for SIM_SOPT4_FTM2TRG1SRC. */
#define BM_SIM_SOPT4_FTM2TRG1SRC (0x00004000U) /*!< Bit mask for SIM_SOPT4_FTM2TRG1SRC. */
#define BS_SIM_SOPT4_FTM2TRG1SRC (1U)      /*!< Bit field size in bits for SIM_SOPT4_FTM2TRG1SRC. */

/*! @brief Read current value of the SIM_SOPT4_FTM2TRG1SRC field. */
#define BR_SIM_SOPT4_FTM2TRG1SRC(x) (BME_UBFX32(HW_SIM_SOPT4_ADDR(x), BP_SIM_SOPT4_FTM2TRG1SRC, BS_SIM_SOPT4_FTM2TRG1SRC))

/*! @brief Format value for bitfield SIM_SOPT4_FTM2TRG1SRC. */
#define BF_SIM_SOPT4_FTM2TRG1SRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT4_FTM2TRG1SRC) & BM_SIM_SOPT4_FTM2TRG1SRC)

/*! @brief Set the FTM2TRG1SRC field to a new value. */
#define BW_SIM_SOPT4_FTM2TRG1SRC(x, v) (BME_BFI32(HW_SIM_SOPT4_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT4_FTM2TRG1SRC), BP_SIM_SOPT4_FTM2TRG1SRC, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM2TRG2SRC[15] (RW)
 *
 * Selects the source of FTM2 hardware trigger 2.
 *
 * Values:
 * - 0 - HSCMP0 output drives FTM2 hardware trigger 2
 * - 1 - HSCMP1 output drives FTM2 hardware trigger 2
 */
/*@{*/
#define BP_SIM_SOPT4_FTM2TRG2SRC (15U)     /*!< Bit position for SIM_SOPT4_FTM2TRG2SRC. */
#define BM_SIM_SOPT4_FTM2TRG2SRC (0x00008000U) /*!< Bit mask for SIM_SOPT4_FTM2TRG2SRC. */
#define BS_SIM_SOPT4_FTM2TRG2SRC (1U)      /*!< Bit field size in bits for SIM_SOPT4_FTM2TRG2SRC. */

/*! @brief Read current value of the SIM_SOPT4_FTM2TRG2SRC field. */
#define BR_SIM_SOPT4_FTM2TRG2SRC(x) (BME_UBFX32(HW_SIM_SOPT4_ADDR(x), BP_SIM_SOPT4_FTM2TRG2SRC, BS_SIM_SOPT4_FTM2TRG2SRC))

/*! @brief Format value for bitfield SIM_SOPT4_FTM2TRG2SRC. */
#define BF_SIM_SOPT4_FTM2TRG2SRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT4_FTM2TRG2SRC) & BM_SIM_SOPT4_FTM2TRG2SRC)

/*! @brief Set the FTM2TRG2SRC field to a new value. */
#define BW_SIM_SOPT4_FTM2TRG2SRC(x, v) (BME_BFI32(HW_SIM_SOPT4_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT4_FTM2TRG2SRC), BP_SIM_SOPT4_FTM2TRG2SRC, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM1ICH0SRC[19:18] (RW)
 *
 * Selects the source for FTM1 channel 0 input capture. When the FTM is not in
 * Input Capture mode, clear this field.
 *
 * Values:
 * - 00 - FTM1_CH0 signal
 * - 01 - CMP0 output
 * - 10 - CMP1 output
 * - 11 - Reserved
 */
/*@{*/
#define BP_SIM_SOPT4_FTM1ICH0SRC (18U)     /*!< Bit position for SIM_SOPT4_FTM1ICH0SRC. */
#define BM_SIM_SOPT4_FTM1ICH0SRC (0x000C0000U) /*!< Bit mask for SIM_SOPT4_FTM1ICH0SRC. */
#define BS_SIM_SOPT4_FTM1ICH0SRC (2U)      /*!< Bit field size in bits for SIM_SOPT4_FTM1ICH0SRC. */

/*! @brief Read current value of the SIM_SOPT4_FTM1ICH0SRC field. */
#define BR_SIM_SOPT4_FTM1ICH0SRC(x) (BME_UBFX32(HW_SIM_SOPT4_ADDR(x), BP_SIM_SOPT4_FTM1ICH0SRC, BS_SIM_SOPT4_FTM1ICH0SRC))

/*! @brief Format value for bitfield SIM_SOPT4_FTM1ICH0SRC. */
#define BF_SIM_SOPT4_FTM1ICH0SRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT4_FTM1ICH0SRC) & BM_SIM_SOPT4_FTM1ICH0SRC)

/*! @brief Set the FTM1ICH0SRC field to a new value. */
#define BW_SIM_SOPT4_FTM1ICH0SRC(x, v) (BME_BFI32(HW_SIM_SOPT4_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT4_FTM1ICH0SRC), BP_SIM_SOPT4_FTM1ICH0SRC, 2))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM2ICH0SRC[21:20] (RW)
 *
 * Selects the source for FTM2 channel 0 input capture. When the FTM is not in
 * Input Capture mode, clear this field.
 *
 * Values:
 * - 00 - FTM2_CH0 signal
 * - 01 - CMP0 output
 * - 10 - CMP1 output
 * - 11 - Reserved
 */
/*@{*/
#define BP_SIM_SOPT4_FTM2ICH0SRC (20U)     /*!< Bit position for SIM_SOPT4_FTM2ICH0SRC. */
#define BM_SIM_SOPT4_FTM2ICH0SRC (0x00300000U) /*!< Bit mask for SIM_SOPT4_FTM2ICH0SRC. */
#define BS_SIM_SOPT4_FTM2ICH0SRC (2U)      /*!< Bit field size in bits for SIM_SOPT4_FTM2ICH0SRC. */

/*! @brief Read current value of the SIM_SOPT4_FTM2ICH0SRC field. */
#define BR_SIM_SOPT4_FTM2ICH0SRC(x) (BME_UBFX32(HW_SIM_SOPT4_ADDR(x), BP_SIM_SOPT4_FTM2ICH0SRC, BS_SIM_SOPT4_FTM2ICH0SRC))

/*! @brief Format value for bitfield SIM_SOPT4_FTM2ICH0SRC. */
#define BF_SIM_SOPT4_FTM2ICH0SRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT4_FTM2ICH0SRC) & BM_SIM_SOPT4_FTM2ICH0SRC)

/*! @brief Set the FTM2ICH0SRC field to a new value. */
#define BW_SIM_SOPT4_FTM2ICH0SRC(x, v) (BME_BFI32(HW_SIM_SOPT4_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT4_FTM2ICH0SRC), BP_SIM_SOPT4_FTM2ICH0SRC, 2))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM2ICH1SRC[22] (RW)
 *
 * Selects the source for FTM2 channel 1 input capture. When the FTM is not in
 * Input Capture mode, clear this field.
 *
 * Values:
 * - 0 - FTM2_CH1 pin is fed to FTM2 CH1
 * - 1 - FTM2_CH1 pin XOR FTM2_CH0 pin XOR FTM1_CH1 pin is fed to FTM2 CH1 If
 *     this field is set, then the three input pins feed FTM2 channel 1 input
 *     capture. In this case, FTM1 channel 1 cannot be used for input capture of FTM1,
 *     as it has no pin. FTM1 channel1 can be used for Output Compare mode of
 *     FTM1, though without an output.
 */
/*@{*/
#define BP_SIM_SOPT4_FTM2ICH1SRC (22U)     /*!< Bit position for SIM_SOPT4_FTM2ICH1SRC. */
#define BM_SIM_SOPT4_FTM2ICH1SRC (0x00400000U) /*!< Bit mask for SIM_SOPT4_FTM2ICH1SRC. */
#define BS_SIM_SOPT4_FTM2ICH1SRC (1U)      /*!< Bit field size in bits for SIM_SOPT4_FTM2ICH1SRC. */

/*! @brief Read current value of the SIM_SOPT4_FTM2ICH1SRC field. */
#define BR_SIM_SOPT4_FTM2ICH1SRC(x) (BME_UBFX32(HW_SIM_SOPT4_ADDR(x), BP_SIM_SOPT4_FTM2ICH1SRC, BS_SIM_SOPT4_FTM2ICH1SRC))

/*! @brief Format value for bitfield SIM_SOPT4_FTM2ICH1SRC. */
#define BF_SIM_SOPT4_FTM2ICH1SRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT4_FTM2ICH1SRC) & BM_SIM_SOPT4_FTM2ICH1SRC)

/*! @brief Set the FTM2ICH1SRC field to a new value. */
#define BW_SIM_SOPT4_FTM2ICH1SRC(x, v) (BME_BFI32(HW_SIM_SOPT4_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT4_FTM2ICH1SRC), BP_SIM_SOPT4_FTM2ICH1SRC, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM0CLKSEL[25:24] (RW)
 *
 * Selects the external pin used to drive the clock to the FTM0 module. The
 * selected pin must also be configured for the FTM external clock function through
 * the appropriate pin control register in the port control module.
 *
 * Values:
 * - 00 - FTM0 external clock driven by FTM_CLKIN0 pin
 * - 01 - FTM0 external clock driven by FTM_CLKIN1 pin
 * - 10 - FTM0 external clock driven by FTM_CLKIN2 pin
 * - 11 - Reserved
 */
/*@{*/
#define BP_SIM_SOPT4_FTM0CLKSEL (24U)      /*!< Bit position for SIM_SOPT4_FTM0CLKSEL. */
#define BM_SIM_SOPT4_FTM0CLKSEL (0x03000000U) /*!< Bit mask for SIM_SOPT4_FTM0CLKSEL. */
#define BS_SIM_SOPT4_FTM0CLKSEL (2U)       /*!< Bit field size in bits for SIM_SOPT4_FTM0CLKSEL. */

/*! @brief Read current value of the SIM_SOPT4_FTM0CLKSEL field. */
#define BR_SIM_SOPT4_FTM0CLKSEL(x) (BME_UBFX32(HW_SIM_SOPT4_ADDR(x), BP_SIM_SOPT4_FTM0CLKSEL, BS_SIM_SOPT4_FTM0CLKSEL))

/*! @brief Format value for bitfield SIM_SOPT4_FTM0CLKSEL. */
#define BF_SIM_SOPT4_FTM0CLKSEL(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT4_FTM0CLKSEL) & BM_SIM_SOPT4_FTM0CLKSEL)

/*! @brief Set the FTM0CLKSEL field to a new value. */
#define BW_SIM_SOPT4_FTM0CLKSEL(x, v) (BME_BFI32(HW_SIM_SOPT4_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT4_FTM0CLKSEL), BP_SIM_SOPT4_FTM0CLKSEL, 2))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM1CLKSEL[27:26] (RW)
 *
 * Selects the external pin used to drive the clock to the FTM1 module. The
 * selected pin must also be configured for the FTM external clock function through
 * the appropriate pin control register in the port control module.
 *
 * Values:
 * - 00 - FTM1 external clock driven by FTM_CLKIN0 pin
 * - 01 - FTM1 external clock driven by FTM_CLKIN1 pin
 * - 10 - FTM1 external clock driven by FTM_CLKIN2 pin
 * - 11 - Reserved
 */
/*@{*/
#define BP_SIM_SOPT4_FTM1CLKSEL (26U)      /*!< Bit position for SIM_SOPT4_FTM1CLKSEL. */
#define BM_SIM_SOPT4_FTM1CLKSEL (0x0C000000U) /*!< Bit mask for SIM_SOPT4_FTM1CLKSEL. */
#define BS_SIM_SOPT4_FTM1CLKSEL (2U)       /*!< Bit field size in bits for SIM_SOPT4_FTM1CLKSEL. */

/*! @brief Read current value of the SIM_SOPT4_FTM1CLKSEL field. */
#define BR_SIM_SOPT4_FTM1CLKSEL(x) (BME_UBFX32(HW_SIM_SOPT4_ADDR(x), BP_SIM_SOPT4_FTM1CLKSEL, BS_SIM_SOPT4_FTM1CLKSEL))

/*! @brief Format value for bitfield SIM_SOPT4_FTM1CLKSEL. */
#define BF_SIM_SOPT4_FTM1CLKSEL(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT4_FTM1CLKSEL) & BM_SIM_SOPT4_FTM1CLKSEL)

