theatrus/ksdk/platform/CMSIS/Include/device/MKV10Z7/MKV10Z7_registers.h
/*! @brief Format value for bitfield SIM_SOPT7_ADC0ALTTRGEN. */
#define BF_SIM_SOPT7_ADC0ALTTRGEN(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT7_ADC0ALTTRGEN) & BM_SIM_SOPT7_ADC0ALTTRGEN)

/*! @brief Set the ADC0ALTTRGEN field to a new value. */
#define BW_SIM_SOPT7_ADC0ALTTRGEN(x, v) (BME_BFI32(HW_SIM_SOPT7_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT7_ADC0ALTTRGEN), BP_SIM_SOPT7_ADC0ALTTRGEN, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADC1TRGSEL[11:8] (RW)
 *
 * Selects the ADC1 trigger source when alternative triggers are functional in
 * Stop and VLPS modes.
 *
 * Values:
 * - 0000 - External trigger pin input (PDB0_EXTRG)
 * - 0001 - HSCMP0 output
 * - 0010 - HSCMP1 output
 * - 0011 - Reserved
 * - 0100 - DMA channel 0 transfer last write complete
 * - 0101 - DMA channel 1 transfer last write complete
 * - 0110 - DMA channel 2 transfer last write complete
 * - 0111 - DMA channel 3 transfer last write complete
 * - 1000 - FTM0 trigger
 * - 1001 - FTM1 trigger
 * - 1010 - FTM2 trigger
 * - 1011 - Reserved
 * - 1100 - Reserved
 * - 1101 - Reserved
 * - 1110 - LPTMR0 trigger
 * - 1011 - Reserved
 */
/*@{*/
#define BP_SIM_SOPT7_ADC1TRGSEL (8U)       /*!< Bit position for SIM_SOPT7_ADC1TRGSEL. */
#define BM_SIM_SOPT7_ADC1TRGSEL (0x00000F00U) /*!< Bit mask for SIM_SOPT7_ADC1TRGSEL. */
#define BS_SIM_SOPT7_ADC1TRGSEL (4U)       /*!< Bit field size in bits for SIM_SOPT7_ADC1TRGSEL. */

/*! @brief Read current value of the SIM_SOPT7_ADC1TRGSEL field. */
#define BR_SIM_SOPT7_ADC1TRGSEL(x) (BME_UBFX32(HW_SIM_SOPT7_ADDR(x), BP_SIM_SOPT7_ADC1TRGSEL, BS_SIM_SOPT7_ADC1TRGSEL))

/*! @brief Format value for bitfield SIM_SOPT7_ADC1TRGSEL. */
#define BF_SIM_SOPT7_ADC1TRGSEL(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT7_ADC1TRGSEL) & BM_SIM_SOPT7_ADC1TRGSEL)

/*! @brief Set the ADC1TRGSEL field to a new value. */
#define BW_SIM_SOPT7_ADC1TRGSEL(x, v) (BME_BFI32(HW_SIM_SOPT7_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT7_ADC1TRGSEL), BP_SIM_SOPT7_ADC1TRGSEL, 4))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADC1PRETRGSEL[12] (RW)
 *
 * Selects the ADC1 pre-trigger source when alternative triggers are enabled
 * through ADC1ALTTRGEN.
 *
 * Values:
 * - 0 - Pre-trigger A for ADC1. Clearing this field will result in ADHWTSA=1
 *     and ADHWTSB=0.
 * - 1 - Pre-trigger B for ADC1. Setting this bit will result in ADHWTSA=0 and
 *     ADHWTSB=1.
 */
/*@{*/
#define BP_SIM_SOPT7_ADC1PRETRGSEL (12U)   /*!< Bit position for SIM_SOPT7_ADC1PRETRGSEL. */
#define BM_SIM_SOPT7_ADC1PRETRGSEL (0x00001000U) /*!< Bit mask for SIM_SOPT7_ADC1PRETRGSEL. */
#define BS_SIM_SOPT7_ADC1PRETRGSEL (1U)    /*!< Bit field size in bits for SIM_SOPT7_ADC1PRETRGSEL. */

/*! @brief Read current value of the SIM_SOPT7_ADC1PRETRGSEL field. */
#define BR_SIM_SOPT7_ADC1PRETRGSEL(x) (BME_UBFX32(HW_SIM_SOPT7_ADDR(x), BP_SIM_SOPT7_ADC1PRETRGSEL, BS_SIM_SOPT7_ADC1PRETRGSEL))

/*! @brief Format value for bitfield SIM_SOPT7_ADC1PRETRGSEL. */
#define BF_SIM_SOPT7_ADC1PRETRGSEL(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT7_ADC1PRETRGSEL) & BM_SIM_SOPT7_ADC1PRETRGSEL)

/*! @brief Set the ADC1PRETRGSEL field to a new value. */
#define BW_SIM_SOPT7_ADC1PRETRGSEL(x, v) (BME_BFI32(HW_SIM_SOPT7_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT7_ADC1PRETRGSEL), BP_SIM_SOPT7_ADC1PRETRGSEL, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADC1ALTTRGEN[15] (RW)
 *
 * Enable alternative conversion triggers for ADC1.
 *
 * Values:
 * - 0 - PDB trigger selected for ADC1
 * - 1 - Alternate trigger selected for ADC1 as defined by ADC1TRGSEL.
 */
/*@{*/
#define BP_SIM_SOPT7_ADC1ALTTRGEN (15U)    /*!< Bit position for SIM_SOPT7_ADC1ALTTRGEN. */
#define BM_SIM_SOPT7_ADC1ALTTRGEN (0x00008000U) /*!< Bit mask for SIM_SOPT7_ADC1ALTTRGEN. */
#define BS_SIM_SOPT7_ADC1ALTTRGEN (1U)     /*!< Bit field size in bits for SIM_SOPT7_ADC1ALTTRGEN. */

/*! @brief Read current value of the SIM_SOPT7_ADC1ALTTRGEN field. */
#define BR_SIM_SOPT7_ADC1ALTTRGEN(x) (BME_UBFX32(HW_SIM_SOPT7_ADDR(x), BP_SIM_SOPT7_ADC1ALTTRGEN, BS_SIM_SOPT7_ADC1ALTTRGEN))

/*! @brief Format value for bitfield SIM_SOPT7_ADC1ALTTRGEN. */
#define BF_SIM_SOPT7_ADC1ALTTRGEN(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT7_ADC1ALTTRGEN) & BM_SIM_SOPT7_ADC1ALTTRGEN)

/*! @brief Set the ADC1ALTTRGEN field to a new value. */
#define BW_SIM_SOPT7_ADC1ALTTRGEN(x, v) (BME_BFI32(HW_SIM_SOPT7_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT7_ADC1ALTTRGEN), BP_SIM_SOPT7_ADC1ALTTRGEN, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADC0ALTCLKSRC[25:24] (RW)
 *
 * Selects the source for the ADC0 ALT clock.
 *
 * Values:
 * - 00 - OUTDIV5 output
 * - 01 - MCGIRCLK
 * - 10 - OSCERCLK
 * - 11 - Reserved
 */
/*@{*/
#define BP_SIM_SOPT7_ADC0ALTCLKSRC (24U)   /*!< Bit position for SIM_SOPT7_ADC0ALTCLKSRC. */
#define BM_SIM_SOPT7_ADC0ALTCLKSRC (0x03000000U) /*!< Bit mask for SIM_SOPT7_ADC0ALTCLKSRC. */
#define BS_SIM_SOPT7_ADC0ALTCLKSRC (2U)    /*!< Bit field size in bits for SIM_SOPT7_ADC0ALTCLKSRC. */

/*! @brief Read current value of the SIM_SOPT7_ADC0ALTCLKSRC field. */
#define BR_SIM_SOPT7_ADC0ALTCLKSRC(x) (BME_UBFX32(HW_SIM_SOPT7_ADDR(x), BP_SIM_SOPT7_ADC0ALTCLKSRC, BS_SIM_SOPT7_ADC0ALTCLKSRC))

/*! @brief Format value for bitfield SIM_SOPT7_ADC0ALTCLKSRC. */
#define BF_SIM_SOPT7_ADC0ALTCLKSRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT7_ADC0ALTCLKSRC) & BM_SIM_SOPT7_ADC0ALTCLKSRC)

/*! @brief Set the ADC0ALTCLKSRC field to a new value. */
#define BW_SIM_SOPT7_ADC0ALTCLKSRC(x, v) (BME_BFI32(HW_SIM_SOPT7_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT7_ADC0ALTCLKSRC), BP_SIM_SOPT7_ADC0ALTCLKSRC, 2))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADC1ALTCLKSRC[27:26] (RW)
 *
 * Selects the source for the ADC1 ALT clock.
 *
 * Values:
 * - 00 - OUTDIV5 output
 * - 01 - MCGIRCLK
 * - 10 - OSCERCLK
 * - 11 - Reserved
 */
/*@{*/
#define BP_SIM_SOPT7_ADC1ALTCLKSRC (26U)   /*!< Bit position for SIM_SOPT7_ADC1ALTCLKSRC. */
#define BM_SIM_SOPT7_ADC1ALTCLKSRC (0x0C000000U) /*!< Bit mask for SIM_SOPT7_ADC1ALTCLKSRC. */
#define BS_SIM_SOPT7_ADC1ALTCLKSRC (2U)    /*!< Bit field size in bits for SIM_SOPT7_ADC1ALTCLKSRC. */

/*! @brief Read current value of the SIM_SOPT7_ADC1ALTCLKSRC field. */
#define BR_SIM_SOPT7_ADC1ALTCLKSRC(x) (BME_UBFX32(HW_SIM_SOPT7_ADDR(x), BP_SIM_SOPT7_ADC1ALTCLKSRC, BS_SIM_SOPT7_ADC1ALTCLKSRC))

/*! @brief Format value for bitfield SIM_SOPT7_ADC1ALTCLKSRC. */
#define BF_SIM_SOPT7_ADC1ALTCLKSRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT7_ADC1ALTCLKSRC) & BM_SIM_SOPT7_ADC1ALTCLKSRC)

