theatrus/ksdk/platform/CMSIS/Include/device/MKV10Z7/MKV10Z7_registers.h
/*! @brief Set the ADC1ALTCLKSRC field to a new value. */
#define BW_SIM_SOPT7_ADC1ALTCLKSRC(x, v) (BME_BFI32(HW_SIM_SOPT7_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT7_ADC1ALTCLKSRC), BP_SIM_SOPT7_ADC1ALTCLKSRC, 2))
/*@}*/

/*******************************************************************************
 * HW_SIM_SOPT8 - System Options Register 8
 ******************************************************************************/

/*!
 * @brief HW_SIM_SOPT8 - System Options Register 8 (RW)
 *
 * Reset value: 0x00000000U
 *
 * SOPT8[FTMxSYNCBIT] provides a mechanism to allow two or more FTMs to be
 * initialized at the same time. Each of the FTMs needs FTMx_SYNC[TRIG0] to be set
 * before software synchronization can occur. The user can perform a simultaneous
 * write of logic "1" to SOPT8[FTMxSYNCBIT], which sets FTMx_SYNC[TRIG0] input to
 * the corresponding FTM on the same bus clock cycle . The TRIGx inputs react to a
 * rising edge and the user must clear SOPT8[FTMxSYNCBIT] to allow other
 * hardware trigger inputs to force a synchronization/refresh event via FTMx_SYNC[TRIG0]
 * input.
 */
typedef union _hw_sim_sopt8
{
    uint32_t U;
    struct _hw_sim_sopt8_bitfields
    {
        uint32_t FTM0SYNCBIT : 1;      /*!< [0] FlexTimer 0 Hardware Trigger 0
                                        * configure by software */
        uint32_t FTM1SYNCBIT : 1;      /*!< [1] FlexTimer 1 Hardware Trigger 0
                                        * configure by software */
        uint32_t FTM2SYNCBIT : 1;      /*!< [2] FlexTimer 2 Hardware Trigger 0
                                        * configure by software */
        uint32_t RESERVED0 : 5;        /*!< [7:3]  */
        uint32_t CARRIER_SELECT : 1;   /*!< [8] Carrier frequency selection for
                                        * FTM0/2 output channel */
        uint32_t RESERVED1 : 7;        /*!< [15:9]  */
        uint32_t FTM0OCH0SRC : 1;      /*!< [16] FTM0 channel 0 output PWM/OCMP
                                        * mode source select */
        uint32_t FTM0OCH1SRC : 1;      /*!< [17] FTM0 channel 1 output PWM/OCMP
                                        * mode source select */
        uint32_t FTM0OCH2SRC : 1;      /*!< [18] FTM0 channel 2 output PWM/OCMP
                                        * mode source select */
        uint32_t FTM0OCH3SRC : 1;      /*!< [19] FTM0 channel 3 output PWM/OCMP
                                        * mode source select */
        uint32_t FTM0OCH4SRC : 1;      /*!< [20] FTM0 channel 4 output PWM/OCMP
                                        * mode source select */
        uint32_t FTM0OCH5SRC : 1;      /*!< [21] FTM0 channel 5 output PWM/OCMP
                                        * mode source select */
        uint32_t FTM2OCH0SRC : 1;      /*!< [22] FTM2 channel 0 output PWM/OCMP
                                        * mode source select */
        uint32_t FTM2OCH1SRC : 1;      /*!< [23] FTM2 channel 1 output PWM/OCMP
                                        * mode source select */
        uint32_t RESERVED2 : 8;        /*!< [31:24]  */
    } B;
} hw_sim_sopt8_t;

/*!
 * @name Constants and macros for entire SIM_SOPT8 register
 */
/*@{*/
#define HW_SIM_SOPT8_ADDR(x)     ((uint32_t)(x) + 0x101CU)

#define HW_SIM_SOPT8(x)          (*(__IO hw_sim_sopt8_t *) HW_SIM_SOPT8_ADDR(x))
#define HW_SIM_SOPT8_RD(x)       (HW_SIM_SOPT8(x).U)
#define HW_SIM_SOPT8_WR(x, v)    (HW_SIM_SOPT8(x).U = (v))
#define HW_SIM_SOPT8_SET(x, v)   (BME_OR32(HW_SIM_SOPT8_ADDR(x), (uint32_t)(v)))
#define HW_SIM_SOPT8_CLR(x, v)   (BME_AND32(HW_SIM_SOPT8_ADDR(x), (uint32_t)(~(v))))
#define HW_SIM_SOPT8_TOG(x, v)   (BME_XOR32(HW_SIM_SOPT8_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual SIM_SOPT8 bitfields
 */

/*!
 * @name Register SIM_SOPT8, field FTM0SYNCBIT[0] (RW)
 *
 * Values:
 * - 0 - No effect to FTM0; this allow the hardware trigger options to function
 *     as expected. See SOPT4[FTM0TRG0SRC].
 * - 1 - If TRIG0 enabled, this refreshes the FTM0CNTIN and all buffered
 *     registers of the FTM0 (must write 0 first then write 1); this masks the hardware
 *     trigger.
 */
/*@{*/
#define BP_SIM_SOPT8_FTM0SYNCBIT (0U)      /*!< Bit position for SIM_SOPT8_FTM0SYNCBIT. */
#define BM_SIM_SOPT8_FTM0SYNCBIT (0x00000001U) /*!< Bit mask for SIM_SOPT8_FTM0SYNCBIT. */
#define BS_SIM_SOPT8_FTM0SYNCBIT (1U)      /*!< Bit field size in bits for SIM_SOPT8_FTM0SYNCBIT. */

/*! @brief Read current value of the SIM_SOPT8_FTM0SYNCBIT field. */
#define BR_SIM_SOPT8_FTM0SYNCBIT(x) (BME_UBFX32(HW_SIM_SOPT8_ADDR(x), BP_SIM_SOPT8_FTM0SYNCBIT, BS_SIM_SOPT8_FTM0SYNCBIT))

/*! @brief Format value for bitfield SIM_SOPT8_FTM0SYNCBIT. */
#define BF_SIM_SOPT8_FTM0SYNCBIT(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT8_FTM0SYNCBIT) & BM_SIM_SOPT8_FTM0SYNCBIT)

/*! @brief Set the FTM0SYNCBIT field to a new value. */
#define BW_SIM_SOPT8_FTM0SYNCBIT(x, v) (BME_BFI32(HW_SIM_SOPT8_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT8_FTM0SYNCBIT), BP_SIM_SOPT8_FTM0SYNCBIT, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM1SYNCBIT[1] (RW)
 *
 * Values:
 * - 0 - No effect to FTM1; this allows the hardware trigger options to function
 *     as expected. See SOPT4[FTM1TRG0SRC].
 * - 1 - If TRIG0 enabled, this refreshes the FTM1CNTIN and all buffered
 *     registers of the FTM1 (must write 0 first then write 1); this masks the hardware
 *     trigger.
 */
/*@{*/
#define BP_SIM_SOPT8_FTM1SYNCBIT (1U)      /*!< Bit position for SIM_SOPT8_FTM1SYNCBIT. */
#define BM_SIM_SOPT8_FTM1SYNCBIT (0x00000002U) /*!< Bit mask for SIM_SOPT8_FTM1SYNCBIT. */
#define BS_SIM_SOPT8_FTM1SYNCBIT (1U)      /*!< Bit field size in bits for SIM_SOPT8_FTM1SYNCBIT. */

/*! @brief Read current value of the SIM_SOPT8_FTM1SYNCBIT field. */
#define BR_SIM_SOPT8_FTM1SYNCBIT(x) (BME_UBFX32(HW_SIM_SOPT8_ADDR(x), BP_SIM_SOPT8_FTM1SYNCBIT, BS_SIM_SOPT8_FTM1SYNCBIT))

/*! @brief Format value for bitfield SIM_SOPT8_FTM1SYNCBIT. */
#define BF_SIM_SOPT8_FTM1SYNCBIT(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT8_FTM1SYNCBIT) & BM_SIM_SOPT8_FTM1SYNCBIT)

/*! @brief Set the FTM1SYNCBIT field to a new value. */
#define BW_SIM_SOPT8_FTM1SYNCBIT(x, v) (BME_BFI32(HW_SIM_SOPT8_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT8_FTM1SYNCBIT), BP_SIM_SOPT8_FTM1SYNCBIT, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM2SYNCBIT[2] (RW)
 *
 * Values:
 * - 0 - No effect to FTM2; this allows the hardware trigger options to function
 *     as expected. See SOPT4[FTM2TRG0SRC].
 * - 1 - If TRIG0 is enabled, this refreshes the FTM2CNTIN and all buffered
 *     registers of the FTM2 (must write 0 first then write 1); this masks the
 *     hardware trigger.
 */
/*@{*/
#define BP_SIM_SOPT8_FTM2SYNCBIT (2U)      /*!< Bit position for SIM_SOPT8_FTM2SYNCBIT. */
#define BM_SIM_SOPT8_FTM2SYNCBIT (0x00000004U) /*!< Bit mask for SIM_SOPT8_FTM2SYNCBIT. */
#define BS_SIM_SOPT8_FTM2SYNCBIT (1U)      /*!< Bit field size in bits for SIM_SOPT8_FTM2SYNCBIT. */

/*! @brief Read current value of the SIM_SOPT8_FTM2SYNCBIT field. */
#define BR_SIM_SOPT8_FTM2SYNCBIT(x) (BME_UBFX32(HW_SIM_SOPT8_ADDR(x), BP_SIM_SOPT8_FTM2SYNCBIT, BS_SIM_SOPT8_FTM2SYNCBIT))

/*! @brief Format value for bitfield SIM_SOPT8_FTM2SYNCBIT. */
#define BF_SIM_SOPT8_FTM2SYNCBIT(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT8_FTM2SYNCBIT) & BM_SIM_SOPT8_FTM2SYNCBIT)

/*! @brief Set the FTM2SYNCBIT field to a new value. */
#define BW_SIM_SOPT8_FTM2SYNCBIT(x, v) (BME_BFI32(HW_SIM_SOPT8_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT8_FTM2SYNCBIT), BP_SIM_SOPT8_FTM2SYNCBIT, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field CARRIER_SELECT[8] (RW)
 *
 * Values:
 * - 0 - FTM1_CH1 output provides the carrier signal for Timer Modulation mode
 * - 1 - LPTMR0 prescaler output provides the carrier signal for Timer
 *     Modulation mode
 */
/*@{*/
#define BP_SIM_SOPT8_CARRIER_SELECT (8U)   /*!< Bit position for SIM_SOPT8_CARRIER_SELECT. */
#define BM_SIM_SOPT8_CARRIER_SELECT (0x00000100U) /*!< Bit mask for SIM_SOPT8_CARRIER_SELECT. */
#define BS_SIM_SOPT8_CARRIER_SELECT (1U)   /*!< Bit field size in bits for SIM_SOPT8_CARRIER_SELECT. */

/*! @brief Read current value of the SIM_SOPT8_CARRIER_SELECT field. */
#define BR_SIM_SOPT8_CARRIER_SELECT(x) (BME_UBFX32(HW_SIM_SOPT8_ADDR(x), BP_SIM_SOPT8_CARRIER_SELECT, BS_SIM_SOPT8_CARRIER_SELECT))

