theatrus/ksdk/platform/CMSIS/Include/device/MKV10Z7/MKV10Z7_registers.h
/*! @brief Read current value of the SIM_SOPT8_FTM0OCH4SRC field. */
#define BR_SIM_SOPT8_FTM0OCH4SRC(x) (BME_UBFX32(HW_SIM_SOPT8_ADDR(x), BP_SIM_SOPT8_FTM0OCH4SRC, BS_SIM_SOPT8_FTM0OCH4SRC))

/*! @brief Format value for bitfield SIM_SOPT8_FTM0OCH4SRC. */
#define BF_SIM_SOPT8_FTM0OCH4SRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT8_FTM0OCH4SRC) & BM_SIM_SOPT8_FTM0OCH4SRC)

/*! @brief Set the FTM0OCH4SRC field to a new value. */
#define BW_SIM_SOPT8_FTM0OCH4SRC(x, v) (BME_BFI32(HW_SIM_SOPT8_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT8_FTM0OCH4SRC), BP_SIM_SOPT8_FTM0OCH4SRC, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM0OCH5SRC[21] (RW)
 *
 * Selects the source for FTM0 channel 5 PWM/OCMP mode. When the FTM is not in
 * output PWM/OCMP mode, clear this field.
 *
 * Values:
 * - 0 - FTM0CH5 pin is the output of FTM0 channel 5 PWM/OCMP
 * - 1 - FTM0CH5 pin is the output of FTM0 channel 5 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT
 */
/*@{*/
#define BP_SIM_SOPT8_FTM0OCH5SRC (21U)     /*!< Bit position for SIM_SOPT8_FTM0OCH5SRC. */
#define BM_SIM_SOPT8_FTM0OCH5SRC (0x00200000U) /*!< Bit mask for SIM_SOPT8_FTM0OCH5SRC. */
#define BS_SIM_SOPT8_FTM0OCH5SRC (1U)      /*!< Bit field size in bits for SIM_SOPT8_FTM0OCH5SRC. */

/*! @brief Read current value of the SIM_SOPT8_FTM0OCH5SRC field. */
#define BR_SIM_SOPT8_FTM0OCH5SRC(x) (BME_UBFX32(HW_SIM_SOPT8_ADDR(x), BP_SIM_SOPT8_FTM0OCH5SRC, BS_SIM_SOPT8_FTM0OCH5SRC))

/*! @brief Format value for bitfield SIM_SOPT8_FTM0OCH5SRC. */
#define BF_SIM_SOPT8_FTM0OCH5SRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT8_FTM0OCH5SRC) & BM_SIM_SOPT8_FTM0OCH5SRC)

/*! @brief Set the FTM0OCH5SRC field to a new value. */
#define BW_SIM_SOPT8_FTM0OCH5SRC(x, v) (BME_BFI32(HW_SIM_SOPT8_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT8_FTM0OCH5SRC), BP_SIM_SOPT8_FTM0OCH5SRC, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM2OCH0SRC[22] (RW)
 *
 * Selects the source for FTM2 channel 0 PWM/OCMP mode. When the FTM is not in
 * output PWM/OCMP mode, clear this field.
 *
 * Values:
 * - 0 - FTM2CH0 pin is the output of FTM2 channel 0 PWM/OCMP
 * - 1 - FTM2CH0 pin is the output of FTM2 channel 0 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT
 */
/*@{*/
#define BP_SIM_SOPT8_FTM2OCH0SRC (22U)     /*!< Bit position for SIM_SOPT8_FTM2OCH0SRC. */
#define BM_SIM_SOPT8_FTM2OCH0SRC (0x00400000U) /*!< Bit mask for SIM_SOPT8_FTM2OCH0SRC. */
#define BS_SIM_SOPT8_FTM2OCH0SRC (1U)      /*!< Bit field size in bits for SIM_SOPT8_FTM2OCH0SRC. */

/*! @brief Read current value of the SIM_SOPT8_FTM2OCH0SRC field. */
#define BR_SIM_SOPT8_FTM2OCH0SRC(x) (BME_UBFX32(HW_SIM_SOPT8_ADDR(x), BP_SIM_SOPT8_FTM2OCH0SRC, BS_SIM_SOPT8_FTM2OCH0SRC))

/*! @brief Format value for bitfield SIM_SOPT8_FTM2OCH0SRC. */
#define BF_SIM_SOPT8_FTM2OCH0SRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT8_FTM2OCH0SRC) & BM_SIM_SOPT8_FTM2OCH0SRC)

/*! @brief Set the FTM2OCH0SRC field to a new value. */
#define BW_SIM_SOPT8_FTM2OCH0SRC(x, v) (BME_BFI32(HW_SIM_SOPT8_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT8_FTM2OCH0SRC), BP_SIM_SOPT8_FTM2OCH0SRC, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM2OCH1SRC[23] (RW)
 *
 * Selects the source for FTM2 channel 1 PWM/OCMP mode. When the FTM is not in
 * output PWM/OCMP mode, clear this field.
 *
 * Values:
 * - 0 - FTM2CH1 pin is the output of FTM2 channel 1 PWM/OCMP
 * - 1 - FTM2CH1 pin is the output of FTM2 channel 1 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT
 */
/*@{*/
#define BP_SIM_SOPT8_FTM2OCH1SRC (23U)     /*!< Bit position for SIM_SOPT8_FTM2OCH1SRC. */
#define BM_SIM_SOPT8_FTM2OCH1SRC (0x00800000U) /*!< Bit mask for SIM_SOPT8_FTM2OCH1SRC. */
#define BS_SIM_SOPT8_FTM2OCH1SRC (1U)      /*!< Bit field size in bits for SIM_SOPT8_FTM2OCH1SRC. */

/*! @brief Read current value of the SIM_SOPT8_FTM2OCH1SRC field. */
#define BR_SIM_SOPT8_FTM2OCH1SRC(x) (BME_UBFX32(HW_SIM_SOPT8_ADDR(x), BP_SIM_SOPT8_FTM2OCH1SRC, BS_SIM_SOPT8_FTM2OCH1SRC))

/*! @brief Format value for bitfield SIM_SOPT8_FTM2OCH1SRC. */
#define BF_SIM_SOPT8_FTM2OCH1SRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT8_FTM2OCH1SRC) & BM_SIM_SOPT8_FTM2OCH1SRC)

/*! @brief Set the FTM2OCH1SRC field to a new value. */
#define BW_SIM_SOPT8_FTM2OCH1SRC(x, v) (BME_BFI32(HW_SIM_SOPT8_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT8_FTM2OCH1SRC), BP_SIM_SOPT8_FTM2OCH1SRC, 1))
/*@}*/

/*******************************************************************************
 * HW_SIM_SDID - System Device Identification Register
 ******************************************************************************/

/*!
 * @brief HW_SIM_SDID - System Device Identification Register (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_sim_sdid
{
    uint32_t U;
    struct _hw_sim_sdid_bitfields
    {
        uint32_t PINID : 4;            /*!< [3:0] Pincount identification */
        uint32_t RESERVED0 : 3;        /*!< [6:4]  */
        uint32_t DIEID : 5;            /*!< [11:7] Device die number */
        uint32_t REVID : 4;            /*!< [15:12] Device revision number */
        uint32_t SRAMSIZE : 4;         /*!< [19:16] System SRAM Size */
        uint32_t SERIERID : 4;         /*!< [23:20] Series ID */
        uint32_t SUBFAMID : 4;         /*!< [27:24] V Sub-family ID */
        uint32_t FAMID : 4;            /*!< [31:28] V-Family ID */
    } B;
} hw_sim_sdid_t;

/*!
 * @name Constants and macros for entire SIM_SDID register
 */
/*@{*/
#define HW_SIM_SDID_ADDR(x)      ((uint32_t)(x) + 0x1024U)

#define HW_SIM_SDID(x)           (*(__I hw_sim_sdid_t *) HW_SIM_SDID_ADDR(x))
#define HW_SIM_SDID_RD(x)        (HW_SIM_SDID(x).U)
/*@}*/

/*
 * Constants & macros for individual SIM_SDID bitfields
 */

/*!
 * @name Register SIM_SDID, field PINID[3:0] (RO)
 *
 * Specifies the pincount of the device.
 *
 * Values:
 * - 0000 - Reserved
 * - 0001 - Reserved
 * - 0010 - 32-pin
 * - 0011 - 44-pin
 * - 0100 - 48-pin
 * - 0101 - Reserved
 * - 0110 - Reserved
 * - 0111 - Reserved
 * - 1000 - Reserved
 * - 1001 - Reserved
 * - 1010 - Reserved
 * - 1011 - Reserved
 * - 1100 - Reserved
 * - 1101 - Reserved
 * - 1110 - Reserved
 * - 1111 - Reserved
 */
/*@{*/
#define BP_SIM_SDID_PINID    (0U)          /*!< Bit position for SIM_SDID_PINID. */
#define BM_SIM_SDID_PINID    (0x0000000FU) /*!< Bit mask for SIM_SDID_PINID. */
#define BS_SIM_SDID_PINID    (4U)          /*!< Bit field size in bits for SIM_SDID_PINID. */

/*! @brief Read current value of the SIM_SDID_PINID field. */
#define BR_SIM_SDID_PINID(x) (BME_UBFX32(HW_SIM_SDID_ADDR(x), BP_SIM_SDID_PINID, BS_SIM_SDID_PINID))
/*@}*/

/*!
 * @name Register SIM_SDID, field DIEID[11:7] (RO)
 *
 * Specifies the silicon implementation number for the device. This field always
 * reads as 00001.
 */
/*@{*/
#define BP_SIM_SDID_DIEID    (7U)          /*!< Bit position for SIM_SDID_DIEID. */
#define BM_SIM_SDID_DIEID    (0x00000F80U) /*!< Bit mask for SIM_SDID_DIEID. */
#define BS_SIM_SDID_DIEID    (5U)          /*!< Bit field size in bits for SIM_SDID_DIEID. */

