theatrus/ksdk/platform/CMSIS/Include/device/MKV10Z7/MKV10Z7_registers.h
/*******************************************************************************
 * HW_SIM_SCGC7 - System Clock Gating Control Register 7
 ******************************************************************************/

/*!
 * @brief HW_SIM_SCGC7 - System Clock Gating Control Register 7 (RW)
 *
 * Reset value: 0x00000100U
 */
typedef union _hw_sim_scgc7
{
    uint32_t U;
    struct _hw_sim_scgc7_bitfields
    {
        uint32_t RESERVED0 : 8;        /*!< [7:0]  */
        uint32_t DMA : 1;              /*!< [8] DMA Clock Gate Control */
        uint32_t RESERVED1 : 23;       /*!< [31:9]  */
    } B;
} hw_sim_scgc7_t;

/*!
 * @name Constants and macros for entire SIM_SCGC7 register
 */
/*@{*/
#define HW_SIM_SCGC7_ADDR(x)     ((uint32_t)(x) + 0x1040U)

#define HW_SIM_SCGC7(x)          (*(__IO hw_sim_scgc7_t *) HW_SIM_SCGC7_ADDR(x))
#define HW_SIM_SCGC7_RD(x)       (HW_SIM_SCGC7(x).U)
#define HW_SIM_SCGC7_WR(x, v)    (HW_SIM_SCGC7(x).U = (v))
#define HW_SIM_SCGC7_SET(x, v)   (BME_OR32(HW_SIM_SCGC7_ADDR(x), (uint32_t)(v)))
#define HW_SIM_SCGC7_CLR(x, v)   (BME_AND32(HW_SIM_SCGC7_ADDR(x), (uint32_t)(~(v))))
#define HW_SIM_SCGC7_TOG(x, v)   (BME_XOR32(HW_SIM_SCGC7_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual SIM_SCGC7 bitfields
 */

/*!
 * @name Register SIM_SCGC7, field DMA[8] (RW)
 *
 * Controls the clock gate to the DMA module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
#define BP_SIM_SCGC7_DMA     (8U)          /*!< Bit position for SIM_SCGC7_DMA. */
#define BM_SIM_SCGC7_DMA     (0x00000100U) /*!< Bit mask for SIM_SCGC7_DMA. */
#define BS_SIM_SCGC7_DMA     (1U)          /*!< Bit field size in bits for SIM_SCGC7_DMA. */

/*! @brief Read current value of the SIM_SCGC7_DMA field. */
#define BR_SIM_SCGC7_DMA(x)  (BME_UBFX32(HW_SIM_SCGC7_ADDR(x), BP_SIM_SCGC7_DMA, BS_SIM_SCGC7_DMA))

/*! @brief Format value for bitfield SIM_SCGC7_DMA. */
#define BF_SIM_SCGC7_DMA(v)  ((uint32_t)((uint32_t)(v) << BP_SIM_SCGC7_DMA) & BM_SIM_SCGC7_DMA)

/*! @brief Set the DMA field to a new value. */
#define BW_SIM_SCGC7_DMA(x, v) (BME_BFI32(HW_SIM_SCGC7_ADDR(x), ((uint32_t)(v) << BP_SIM_SCGC7_DMA), BP_SIM_SCGC7_DMA, 1))
/*@}*/

/*******************************************************************************
 * HW_SIM_CLKDIV1 - System Clock Divider Register 1
 ******************************************************************************/

/*!
 * @brief HW_SIM_CLKDIV1 - System Clock Divider Register 1 (RW)
 *
 * Reset value: 0x00011000U
 *
 * The CLKDIV1 register cannot be written to when the device is in VLPR mode.
 */
typedef union _hw_sim_clkdiv1
{
    uint32_t U;
    struct _hw_sim_clkdiv1_bitfields
    {
        uint32_t RESERVED0 : 12;       /*!< [11:0]  */
        uint32_t OUTDIV5 : 3;          /*!< [14:12] Clock 5 Output Divider Value */
        uint32_t OUTDIV5EN : 1;        /*!< [15] OUTDIV5 Divider Control */
        uint32_t OUTDIV4 : 3;          /*!< [18:16] Clock 4 Output Divider Value */
        uint32_t RESERVED1 : 9;        /*!< [27:19]  */
        uint32_t OUTDIV1 : 4;          /*!< [31:28] Clock 1 Output Divider Value */
    } B;
} hw_sim_clkdiv1_t;

/*!
 * @name Constants and macros for entire SIM_CLKDIV1 register
 */
/*@{*/
#define HW_SIM_CLKDIV1_ADDR(x)   ((uint32_t)(x) + 0x1044U)

#define HW_SIM_CLKDIV1(x)        (*(__IO hw_sim_clkdiv1_t *) HW_SIM_CLKDIV1_ADDR(x))
#define HW_SIM_CLKDIV1_RD(x)     (HW_SIM_CLKDIV1(x).U)
#define HW_SIM_CLKDIV1_WR(x, v)  (HW_SIM_CLKDIV1(x).U = (v))
#define HW_SIM_CLKDIV1_SET(x, v) (BME_OR32(HW_SIM_CLKDIV1_ADDR(x), (uint32_t)(v)))
#define HW_SIM_CLKDIV1_CLR(x, v) (BME_AND32(HW_SIM_CLKDIV1_ADDR(x), (uint32_t)(~(v))))
#define HW_SIM_CLKDIV1_TOG(x, v) (BME_XOR32(HW_SIM_CLKDIV1_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual SIM_CLKDIV1 bitfields
 */

/*!
 * @name Register SIM_CLKDIV1, field OUTDIV5[14:12] (RW)
 *
 * Sets the divide value for the alternative ADC clock and is in addition to the
 * System clock divide ratio. At the end of reset, it is loaded with 001 (divide
 * by two).
 *
 * Values:
 * - 000 - Divide-by-1
 * - 001 - Divide-by-2
 * - 010 - Divide-by-3
 * - 011 - Divide-by-4
 * - 100 - Divide-by-5
 * - 101 - Divide-by-6
 * - 110 - Divide-by-7
 * - 111 - Divide-by-8
 */
/*@{*/
#define BP_SIM_CLKDIV1_OUTDIV5 (12U)       /*!< Bit position for SIM_CLKDIV1_OUTDIV5. */
#define BM_SIM_CLKDIV1_OUTDIV5 (0x00007000U) /*!< Bit mask for SIM_CLKDIV1_OUTDIV5. */
#define BS_SIM_CLKDIV1_OUTDIV5 (3U)        /*!< Bit field size in bits for SIM_CLKDIV1_OUTDIV5. */

/*! @brief Read current value of the SIM_CLKDIV1_OUTDIV5 field. */
#define BR_SIM_CLKDIV1_OUTDIV5(x) (BME_UBFX32(HW_SIM_CLKDIV1_ADDR(x), BP_SIM_CLKDIV1_OUTDIV5, BS_SIM_CLKDIV1_OUTDIV5))

/*! @brief Format value for bitfield SIM_CLKDIV1_OUTDIV5. */
#define BF_SIM_CLKDIV1_OUTDIV5(v) ((uint32_t)((uint32_t)(v) << BP_SIM_CLKDIV1_OUTDIV5) & BM_SIM_CLKDIV1_OUTDIV5)

/*! @brief Set the OUTDIV5 field to a new value. */
#define BW_SIM_CLKDIV1_OUTDIV5(x, v) (BME_BFI32(HW_SIM_CLKDIV1_ADDR(x), ((uint32_t)(v) << BP_SIM_CLKDIV1_OUTDIV5), BP_SIM_CLKDIV1_OUTDIV5, 3))
/*@}*/

/*!
 * @name Register SIM_CLKDIV1, field OUTDIV5EN[15] (RW)
 *
 * This bit controls the OUTDIV5 divider.
 *
 * Values:
 * - 0 - OUTDIV5 disabled
 * - 1 - OUTDIV5 enabled
 */
/*@{*/
#define BP_SIM_CLKDIV1_OUTDIV5EN (15U)     /*!< Bit position for SIM_CLKDIV1_OUTDIV5EN. */
#define BM_SIM_CLKDIV1_OUTDIV5EN (0x00008000U) /*!< Bit mask for SIM_CLKDIV1_OUTDIV5EN. */
#define BS_SIM_CLKDIV1_OUTDIV5EN (1U)      /*!< Bit field size in bits for SIM_CLKDIV1_OUTDIV5EN. */

/*! @brief Read current value of the SIM_CLKDIV1_OUTDIV5EN field. */
#define BR_SIM_CLKDIV1_OUTDIV5EN(x) (BME_UBFX32(HW_SIM_CLKDIV1_ADDR(x), BP_SIM_CLKDIV1_OUTDIV5EN, BS_SIM_CLKDIV1_OUTDIV5EN))

/*! @brief Format value for bitfield SIM_CLKDIV1_OUTDIV5EN. */
#define BF_SIM_CLKDIV1_OUTDIV5EN(v) ((uint32_t)((uint32_t)(v) << BP_SIM_CLKDIV1_OUTDIV5EN) & BM_SIM_CLKDIV1_OUTDIV5EN)

