theatrus/ksdk/platform/CMSIS/Include/device/MKV10Z7/MKV10Z7_registers.h
/*******************************************************************************
 * HW_SIM_UIDL - Unique Identification Register Low
 ******************************************************************************/

/*!
 * @brief HW_SIM_UIDL - Unique Identification Register Low (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_sim_uidl
{
    uint32_t U;
    struct _hw_sim_uidl_bitfields
    {
        uint32_t UID : 32;             /*!< [31:0] Unique Identification */
    } B;
} hw_sim_uidl_t;

/*!
 * @name Constants and macros for entire SIM_UIDL register
 */
/*@{*/
#define HW_SIM_UIDL_ADDR(x)      ((uint32_t)(x) + 0x1060U)

#define HW_SIM_UIDL(x)           (*(__I hw_sim_uidl_t *) HW_SIM_UIDL_ADDR(x))
#define HW_SIM_UIDL_RD(x)        (HW_SIM_UIDL(x).U)
/*@}*/

/*
 * Constants & macros for individual SIM_UIDL bitfields
 */

/*!
 * @name Register SIM_UIDL, field UID[31:0] (RO)
 *
 * Unique identification for the device.
 */
/*@{*/
#define BP_SIM_UIDL_UID      (0U)          /*!< Bit position for SIM_UIDL_UID. */
#define BM_SIM_UIDL_UID      (0xFFFFFFFFU) /*!< Bit mask for SIM_UIDL_UID. */
#define BS_SIM_UIDL_UID      (32U)         /*!< Bit field size in bits for SIM_UIDL_UID. */

/*! @brief Read current value of the SIM_UIDL_UID field. */
#define BR_SIM_UIDL_UID(x)   (HW_SIM_UIDL(x).U)
/*@}*/

/*******************************************************************************
 * HW_SIM_WDOGCTRL - WDOG Control Register
 ******************************************************************************/

/*!
 * @brief HW_SIM_WDOGCTRL - WDOG Control Register (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_sim_wdogctrl
{
    uint32_t U;
    struct _hw_sim_wdogctrl_bitfields
    {
        uint32_t RESERVED0 : 1;        /*!< [0]  */
        uint32_t WDOGCLKS : 1;         /*!< [1] WDOG Clock Select */
        uint32_t RESERVED1 : 30;       /*!< [31:2]  */
    } B;
} hw_sim_wdogctrl_t;

/*!
 * @name Constants and macros for entire SIM_WDOGCTRL register
 */
/*@{*/
#define HW_SIM_WDOGCTRL_ADDR(x)  ((uint32_t)(x) + 0x1100U)

#define HW_SIM_WDOGCTRL(x)       (*(__IO hw_sim_wdogctrl_t *) HW_SIM_WDOGCTRL_ADDR(x))
#define HW_SIM_WDOGCTRL_RD(x)    (HW_SIM_WDOGCTRL(x).U)
#define HW_SIM_WDOGCTRL_WR(x, v) (HW_SIM_WDOGCTRL(x).U = (v))
#define HW_SIM_WDOGCTRL_SET(x, v) (BME_OR32(HW_SIM_WDOGCTRL_ADDR(x), (uint32_t)(v)))
#define HW_SIM_WDOGCTRL_CLR(x, v) (BME_AND32(HW_SIM_WDOGCTRL_ADDR(x), (uint32_t)(~(v))))
#define HW_SIM_WDOGCTRL_TOG(x, v) (BME_XOR32(HW_SIM_WDOGCTRL_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual SIM_WDOGCTRL bitfields
 */

/*!
 * @name Register SIM_WDOGCTRL, field WDOGCLKS[1] (RW)
 *
 * Selects the default clock source of the WDOG watchdog. On reset it will be
 * the 1kHZ LPO. The software can change this to the MCGIRCLK, which can be 32KHz
 * or 4Mhz, depending on the MCG configuration.
 *
 * Values:
 * - 0 - Internal 1 kHz clock is source to WDOG
 * - 1 - MCGIRCLK is source to WDOG
 */
/*@{*/
#define BP_SIM_WDOGCTRL_WDOGCLKS (1U)      /*!< Bit position for SIM_WDOGCTRL_WDOGCLKS. */
#define BM_SIM_WDOGCTRL_WDOGCLKS (0x00000002U) /*!< Bit mask for SIM_WDOGCTRL_WDOGCLKS. */
#define BS_SIM_WDOGCTRL_WDOGCLKS (1U)      /*!< Bit field size in bits for SIM_WDOGCTRL_WDOGCLKS. */

/*! @brief Read current value of the SIM_WDOGCTRL_WDOGCLKS field. */
#define BR_SIM_WDOGCTRL_WDOGCLKS(x) (BME_UBFX32(HW_SIM_WDOGCTRL_ADDR(x), BP_SIM_WDOGCTRL_WDOGCLKS, BS_SIM_WDOGCTRL_WDOGCLKS))

/*! @brief Format value for bitfield SIM_WDOGCTRL_WDOGCLKS. */
#define BF_SIM_WDOGCTRL_WDOGCLKS(v) ((uint32_t)((uint32_t)(v) << BP_SIM_WDOGCTRL_WDOGCLKS) & BM_SIM_WDOGCTRL_WDOGCLKS)

/*! @brief Set the WDOGCLKS field to a new value. */
#define BW_SIM_WDOGCTRL_WDOGCLKS(x, v) (BME_BFI32(HW_SIM_WDOGCTRL_ADDR(x), ((uint32_t)(v) << BP_SIM_WDOGCTRL_WDOGCLKS), BP_SIM_WDOGCTRL_WDOGCLKS, 1))
/*@}*/

/*******************************************************************************
 * hw_sim_t - module struct
 ******************************************************************************/
/*!
 * @brief All SIM module registers.
 */
#pragma pack(1)
typedef struct _hw_sim
{
    __IO hw_sim_sopt1_t SOPT1;             /*!< [0x0] System Options Register 1 */
    uint8_t _reserved0[4096];
    __IO hw_sim_sopt2_t SOPT2;             /*!< [0x1004] System Options Register 2 */
    uint8_t _reserved1[4];
    __IO hw_sim_sopt4_t SOPT4;             /*!< [0x100C] System Options Register 4 */
    __IO hw_sim_sopt5_t SOPT5;             /*!< [0x1010] System Options Register 5 */
    uint8_t _reserved2[4];
    __IO hw_sim_sopt7_t SOPT7;             /*!< [0x1018] System Options Register 7 */
    __IO hw_sim_sopt8_t SOPT8;             /*!< [0x101C] System Options Register 8 */
    uint8_t _reserved3[4];
    __I hw_sim_sdid_t SDID;                /*!< [0x1024] System Device Identification Register */
    uint8_t _reserved4[12];
    __IO hw_sim_scgc4_t SCGC4;             /*!< [0x1034] System Clock Gating Control Register 4 */
    __IO hw_sim_scgc5_t SCGC5;             /*!< [0x1038] System Clock Gating Control Register 5 */
    __IO hw_sim_scgc6_t SCGC6;             /*!< [0x103C] System Clock Gating Control Register 6 */
    __IO hw_sim_scgc7_t SCGC7;             /*!< [0x1040] System Clock Gating Control Register 7 */
    __IO hw_sim_clkdiv1_t CLKDIV1;         /*!< [0x1044] System Clock Divider Register 1 */
    uint8_t _reserved5[4];
    __IO hw_sim_fcfg1_t FCFG1;             /*!< [0x104C] Flash Configuration Register 1 */
    __I hw_sim_fcfg2_t FCFG2;              /*!< [0x1050] Flash Configuration Register 2 */
    uint8_t _reserved6[4];
    __I hw_sim_uidmh_t UIDMH;              /*!< [0x1058] Unique Identification Register Mid-High */
    __I hw_sim_uidml_t UIDML;              /*!< [0x105C] Unique Identification Register Mid Low */
    __I hw_sim_uidl_t UIDL;                /*!< [0x1060] Unique Identification Register Low */
    uint8_t _reserved7[156];
    __IO hw_sim_wdogctrl_t WDOGCTRL;       /*!< [0x1100] WDOG Control Register */
} hw_sim_t;
#pragma pack()

/*! @brief Macro to access all SIM registers. */
/*! @param x SIM module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_SIM_REGS(SIM_BASE)</code>. */
#define HW_SIM_REGS(x) (*(hw_sim_t *)(x))

