theatrus/ksdk/platform/CMSIS/Include/device/MKV10Z7/MKV10Z7_registers.h
/*! @brief Read current value of the SPI_RSER_TCF_RE field. */
#define BR_SPI_RSER_TCF_RE(x) (BME_UBFX32(HW_SPI_RSER_ADDR(x), BP_SPI_RSER_TCF_RE, BS_SPI_RSER_TCF_RE))

/*! @brief Format value for bitfield SPI_RSER_TCF_RE. */
#define BF_SPI_RSER_TCF_RE(v) ((uint32_t)((uint32_t)(v) << BP_SPI_RSER_TCF_RE) & BM_SPI_RSER_TCF_RE)

/*! @brief Set the TCF_RE field to a new value. */
#define BW_SPI_RSER_TCF_RE(x, v) (BME_BFI32(HW_SPI_RSER_ADDR(x), ((uint32_t)(v) << BP_SPI_RSER_TCF_RE), BP_SPI_RSER_TCF_RE, 1))
/*@}*/

/*******************************************************************************
 * HW_SPI_PUSHR - PUSH TX FIFO Register In Master Mode
 ******************************************************************************/

/*!
 * @brief HW_SPI_PUSHR - PUSH TX FIFO Register In Master Mode (RW)
 *
 * Reset value: 0x00000000U
 *
 * Specifies data to be transferred to the TX FIFO and CMD FIFO. An 8- or 16-bit
 * write access to the TXDATA field transfers the 16 bits of data to the TX
 * FIFO. A write access to the command fields transfers the 16 bits of command
 * information to the CMD FIFO. In Master mode, the register transfers 16 bits of data
 * to the TX FIFO and 16 bits of command information to the CMD FIFO. In Slave
 * mode, the CMD FIFO is not used and the 16 bits of command information are
 * reserved. The TX FIFO and CMD FIFO must be filled simultaneously. In other words,
 * you must perform write accesses to both the data and command fields for every
 * PUSHR operation. Because both the TX FIFO and CMD FIFO are written to and read
 * from simultaneously, they behave as a single 32 bit FIFO. A read access of
 * PUSHR returns the topmost TX FIFO and CMD FIFO entries concatenated. When the
 * module is disabled, writing to this register does not update the FIFO. Therefore,
 * any reads performed while the module is disabled return the last PUSHR write
 * performed while the module was still enabled.
 */
typedef union _hw_spi_pushr
{
    uint32_t U;
    struct _hw_spi_pushr_bitfields
    {
        uint32_t TXDATA : 16;          /*!< [15:0] Transmit Data */
        uint32_t PCS : 5;              /*!< [20:16]  */
        uint32_t RESERVED0 : 5;        /*!< [25:21] These bits should not be written
                                        * by the user. Writes to a reserved location can result in unpredictable
                                        * functionality or behavior. */
        uint32_t CTCNT : 1;            /*!< [26] Clear Transfer Counter */
        uint32_t EOQ : 1;              /*!< [27] End Of Queue */
        uint32_t CTAS : 3;             /*!< [30:28] Clock and Transfer Attributes Select
                                        * */
        uint32_t CONT : 1;             /*!< [31] Continuous Peripheral Chip Select Enable
                                        * */
    } B;
} hw_spi_pushr_t;

/*!
 * @name Constants and macros for entire SPI_PUSHR register
 */
/*@{*/
#define HW_SPI_PUSHR_ADDR(x)     ((uint32_t)(x) + 0x34U)

#define HW_SPI_PUSHR(x)          (*(__IO hw_spi_pushr_t *) HW_SPI_PUSHR_ADDR(x))
#define HW_SPI_PUSHR_RD(x)       (HW_SPI_PUSHR(x).U)
#define HW_SPI_PUSHR_WR(x, v)    (HW_SPI_PUSHR(x).U = (v))
#define HW_SPI_PUSHR_SET(x, v)   (BME_OR32(HW_SPI_PUSHR_ADDR(x), (uint32_t)(v)))
#define HW_SPI_PUSHR_CLR(x, v)   (BME_AND32(HW_SPI_PUSHR_ADDR(x), (uint32_t)(~(v))))
#define HW_SPI_PUSHR_TOG(x, v)   (BME_XOR32(HW_SPI_PUSHR_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual SPI_PUSHR bitfields
 */

/*!
 * @name Register SPI_PUSHR, field TXDATA[15:0] (RW)
 *
 * Holds SPI data to be transferred according to the associated SPI command.
 */
/*@{*/
#define BP_SPI_PUSHR_TXDATA  (0U)          /*!< Bit position for SPI_PUSHR_TXDATA. */
#define BM_SPI_PUSHR_TXDATA  (0x0000FFFFU) /*!< Bit mask for SPI_PUSHR_TXDATA. */
#define BS_SPI_PUSHR_TXDATA  (16U)         /*!< Bit field size in bits for SPI_PUSHR_TXDATA. */

/*! @brief Read current value of the SPI_PUSHR_TXDATA field. */
#define BR_SPI_PUSHR_TXDATA(x) (BME_UBFX32(HW_SPI_PUSHR_ADDR(x), BP_SPI_PUSHR_TXDATA, BS_SPI_PUSHR_TXDATA))

/*! @brief Format value for bitfield SPI_PUSHR_TXDATA. */
#define BF_SPI_PUSHR_TXDATA(v) ((uint32_t)((uint32_t)(v) << BP_SPI_PUSHR_TXDATA) & BM_SPI_PUSHR_TXDATA)

/*! @brief Set the TXDATA field to a new value. */
#define BW_SPI_PUSHR_TXDATA(x, v) (BME_BFI32(HW_SPI_PUSHR_ADDR(x), ((uint32_t)(v) << BP_SPI_PUSHR_TXDATA), BP_SPI_PUSHR_TXDATA, 16))
/*@}*/

/*!
 * @name Register SPI_PUSHR, field PCS[20:16] (RW)
 *
 * Select which PCS signals are to be asserted for the transfer. Refer to the
 * chip configuration details for the number of PCS signals used in this MCU.
 *
 * Values:
 * - 0 - Negate the PCS[x] signal.
 * - 1 - Assert the PCS[x] signal.
 */
/*@{*/
#define BP_SPI_PUSHR_PCS     (16U)         /*!< Bit position for SPI_PUSHR_PCS. */
#define BM_SPI_PUSHR_PCS     (0x001F0000U) /*!< Bit mask for SPI_PUSHR_PCS. */
#define BS_SPI_PUSHR_PCS     (5U)          /*!< Bit field size in bits for SPI_PUSHR_PCS. */

/*! @brief Read current value of the SPI_PUSHR_PCS field. */
#define BR_SPI_PUSHR_PCS(x)  (BME_UBFX32(HW_SPI_PUSHR_ADDR(x), BP_SPI_PUSHR_PCS, BS_SPI_PUSHR_PCS))

/*! @brief Format value for bitfield SPI_PUSHR_PCS. */
#define BF_SPI_PUSHR_PCS(v)  ((uint32_t)((uint32_t)(v) << BP_SPI_PUSHR_PCS) & BM_SPI_PUSHR_PCS)

/*! @brief Set the PCS field to a new value. */
#define BW_SPI_PUSHR_PCS(x, v) (BME_BFI32(HW_SPI_PUSHR_ADDR(x), ((uint32_t)(v) << BP_SPI_PUSHR_PCS), BP_SPI_PUSHR_PCS, 5))
/*@}*/

/*!
 * @name Register SPI_PUSHR, field CTCNT[26] (RW)
 *
 * Clears the TCNT field in the TCR register. The TCNT field is cleared before
 * the module starts transmitting the current SPI frame.
 *
 * Values:
 * - 0 - Do not clear the TCR[TCNT] field.
 * - 1 - Clear the TCR[TCNT] field.
 */
/*@{*/
#define BP_SPI_PUSHR_CTCNT   (26U)         /*!< Bit position for SPI_PUSHR_CTCNT. */
#define BM_SPI_PUSHR_CTCNT   (0x04000000U) /*!< Bit mask for SPI_PUSHR_CTCNT. */
#define BS_SPI_PUSHR_CTCNT   (1U)          /*!< Bit field size in bits for SPI_PUSHR_CTCNT. */

/*! @brief Read current value of the SPI_PUSHR_CTCNT field. */
#define BR_SPI_PUSHR_CTCNT(x) (BME_UBFX32(HW_SPI_PUSHR_ADDR(x), BP_SPI_PUSHR_CTCNT, BS_SPI_PUSHR_CTCNT))

/*! @brief Format value for bitfield SPI_PUSHR_CTCNT. */
#define BF_SPI_PUSHR_CTCNT(v) ((uint32_t)((uint32_t)(v) << BP_SPI_PUSHR_CTCNT) & BM_SPI_PUSHR_CTCNT)

/*! @brief Set the CTCNT field to a new value. */
#define BW_SPI_PUSHR_CTCNT(x, v) (BME_BFI32(HW_SPI_PUSHR_ADDR(x), ((uint32_t)(v) << BP_SPI_PUSHR_CTCNT), BP_SPI_PUSHR_CTCNT, 1))
/*@}*/

/*!
 * @name Register SPI_PUSHR, field EOQ[27] (RW)
 *
 * Host software uses this bit to signal to the module that the current SPI
 * transfer is the last in a queue. At the end of the transfer, the EOQF bit in the
 * SR is set.
 *
 * Values:
 * - 0 - The SPI data is not the last data to transfer.
 * - 1 - The SPI data is the last data to transfer.
 */
/*@{*/
#define BP_SPI_PUSHR_EOQ     (27U)         /*!< Bit position for SPI_PUSHR_EOQ. */
#define BM_SPI_PUSHR_EOQ     (0x08000000U) /*!< Bit mask for SPI_PUSHR_EOQ. */
#define BS_SPI_PUSHR_EOQ     (1U)          /*!< Bit field size in bits for SPI_PUSHR_EOQ. */

