theatrus/ksdk/platform/CMSIS/Include/device/MKV10Z7/MKV10Z7_registers.h
/*
 * Constants & macros for individual SPI_SREX bitfields
 */

/*!
 * @name Register SPI_SREX, field CMDNXTPTR[3:0] (RO)
 *
 * Indicates which CMD FIFO Entry is used during the next transfer. The
 * CMDNXTPTR field is updated every time SPI data due to current command have been
 * transmitted.
 */
/*@{*/
#define BP_SPI_SREX_CMDNXTPTR (0U)         /*!< Bit position for SPI_SREX_CMDNXTPTR. */
#define BM_SPI_SREX_CMDNXTPTR (0x0000000FU) /*!< Bit mask for SPI_SREX_CMDNXTPTR. */
#define BS_SPI_SREX_CMDNXTPTR (4U)         /*!< Bit field size in bits for SPI_SREX_CMDNXTPTR. */

/*! @brief Read current value of the SPI_SREX_CMDNXTPTR field. */
#define BR_SPI_SREX_CMDNXTPTR(x) (BME_UBFX32(HW_SPI_SREX_ADDR(x), BP_SPI_SREX_CMDNXTPTR, BS_SPI_SREX_CMDNXTPTR))
/*@}*/

/*!
 * @name Register SPI_SREX, field CMDCTR[8:4] (RO)
 *
 * Indicates the number of entries in the CMD FIFO. The CMDCTR is incremented
 * every time the command part of PUSHR is written. The CMDCTR is decremented every
 * time a SPI command is executed (all data frames due to current command frame
 * have been transmitted).
 */
/*@{*/
#define BP_SPI_SREX_CMDCTR   (4U)          /*!< Bit position for SPI_SREX_CMDCTR. */
#define BM_SPI_SREX_CMDCTR   (0x000001F0U) /*!< Bit mask for SPI_SREX_CMDCTR. */
#define BS_SPI_SREX_CMDCTR   (5U)          /*!< Bit field size in bits for SPI_SREX_CMDCTR. */

/*! @brief Read current value of the SPI_SREX_CMDCTR field. */
#define BR_SPI_SREX_CMDCTR(x) (BME_UBFX32(HW_SPI_SREX_ADDR(x), BP_SPI_SREX_CMDCTR, BS_SPI_SREX_CMDCTR))
/*@}*/

/*!
 * @name Register SPI_SREX, field TXCTR4[11] (RW)
 *
 * This bit is an extension of SR[TXCTR]. The concatenated field {TXCTR4, TXCTR}
 * indicates the number of valid entries in the TX FIFO. This field is
 * incremented every time the PUSHR is written. And this field is decremented every time
 * an SPI command is executed and the SPI data is transferred to the shift
 * register.
 */
/*@{*/
#define BP_SPI_SREX_TXCTR4   (11U)         /*!< Bit position for SPI_SREX_TXCTR4. */
#define BM_SPI_SREX_TXCTR4   (0x00000800U) /*!< Bit mask for SPI_SREX_TXCTR4. */
#define BS_SPI_SREX_TXCTR4   (1U)          /*!< Bit field size in bits for SPI_SREX_TXCTR4. */

/*! @brief Read current value of the SPI_SREX_TXCTR4 field. */
#define BR_SPI_SREX_TXCTR4(x) (BME_UBFX32(HW_SPI_SREX_ADDR(x), BP_SPI_SREX_TXCTR4, BS_SPI_SREX_TXCTR4))

/*! @brief Format value for bitfield SPI_SREX_TXCTR4. */
#define BF_SPI_SREX_TXCTR4(v) ((uint32_t)((uint32_t)(v) << BP_SPI_SREX_TXCTR4) & BM_SPI_SREX_TXCTR4)

/*! @brief Set the TXCTR4 field to a new value. */
#define BW_SPI_SREX_TXCTR4(x, v) (BME_BFI32(HW_SPI_SREX_ADDR(x), ((uint32_t)(v) << BP_SPI_SREX_TXCTR4), BP_SPI_SREX_TXCTR4, 1))
/*@}*/

/*!
 * @name Register SPI_SREX, field RXCTR4[14] (RW)
 *
 * This bit is an extension of SR[RXCTR]. The concatenated field {RXCTR4, RXCTR}
 * indicates the number of entries in the RX FIFO. This field is decremented
 * every time the POPR is read. And this field is incremented every time data is
 * transferred from the shift register to the RX FIFO.
 */
/*@{*/
#define BP_SPI_SREX_RXCTR4   (14U)         /*!< Bit position for SPI_SREX_RXCTR4. */
#define BM_SPI_SREX_RXCTR4   (0x00004000U) /*!< Bit mask for SPI_SREX_RXCTR4. */
#define BS_SPI_SREX_RXCTR4   (1U)          /*!< Bit field size in bits for SPI_SREX_RXCTR4. */

/*! @brief Read current value of the SPI_SREX_RXCTR4 field. */
#define BR_SPI_SREX_RXCTR4(x) (BME_UBFX32(HW_SPI_SREX_ADDR(x), BP_SPI_SREX_RXCTR4, BS_SPI_SREX_RXCTR4))

/*! @brief Format value for bitfield SPI_SREX_RXCTR4. */
#define BF_SPI_SREX_RXCTR4(v) ((uint32_t)((uint32_t)(v) << BP_SPI_SREX_RXCTR4) & BM_SPI_SREX_RXCTR4)

/*! @brief Set the RXCTR4 field to a new value. */
#define BW_SPI_SREX_RXCTR4(x, v) (BME_BFI32(HW_SPI_SREX_ADDR(x), ((uint32_t)(v) << BP_SPI_SREX_RXCTR4), BP_SPI_SREX_RXCTR4, 1))
/*@}*/

/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma push
  #pragma anon_unions
#elif defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/*******************************************************************************
 * hw_spi_t - module struct
 ******************************************************************************/
/*!
 * @brief All SPI module registers.
 */
#pragma pack(1)
typedef struct _hw_spi
{
    __IO hw_spi_mcr_t MCR;                 /*!< [0x0] Module Configuration Register */
    uint8_t _reserved0[4];
    __IO hw_spi_tcr_t TCR;                 /*!< [0x8] Transfer Count Register */
    union {
        __IO hw_spi_ctarn_t CTARn[2];      /*!< [0xC] Clock and Transfer Attributes Register (In Master Mode) */
        __IO hw_spi_ctarn_slave_t CTARn_SLAVE[1]; /*!< [0xC] Clock and Transfer Attributes Register (In Slave Mode) */
    };
    uint8_t _reserved1[24];
    __IO hw_spi_sr_t SR;                   /*!< [0x2C] Status Register */
    __IO hw_spi_rser_t RSER;               /*!< [0x30] DMA/Interrupt Request Select and Enable Register */
    union {
        __IO hw_spi_pushr_t PUSHR;         /*!< [0x34] PUSH TX FIFO Register In Master Mode */
        __IO hw_spi_pushr_slave_t PUSHR_SLAVE; /*!< [0x34] PUSH TX FIFO Register In Slave Mode */
    };
    __I hw_spi_popr_t POPR;                /*!< [0x38] POP RX FIFO Register */
    __I hw_spi_txfrn_t TXFRn[4];           /*!< [0x3C] Transmit FIFO Registers */
    uint8_t _reserved2[48];
    __I hw_spi_rxfrn_t RXFRn[4];           /*!< [0x7C] Receive FIFO Registers */
    uint8_t _reserved3[176];
    __IO hw_spi_srex_t SREX;               /*!< [0x13C] Status Register Extended */
} hw_spi_t;
#pragma pack()

/*! @brief Macro to access all SPI registers. */
/*! @param x SPI module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_SPI_REGS(SPI0_BASE)</code>. */
#define HW_SPI_REGS(x) (*(hw_spi_t *)(x))

